SkydiverMCU/mcu-iap-demo/STAR-MC1/MM32F5370/USB_Custom_HID/MM32F5370_HID_Bootloader/Device/MM32F5370/Include/reg_adc.h
/***********************************************************************************************************************
    @file     reg_adc.h
    @author   VV TEAM
    @brief    This flie contains all the ADC's register and its field definition.
  **********************************************************************************************************************
    @attention

    <h2><center>&copy; Copyright(c) <2023> <MindMotion></center></h2>

      Redistribution and use in source and binary forms, with or without modification, are permitted provided that the
    following conditions are met:
    1. Redistributions of source code must retain the above copyright notice,
       this list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice, this list of conditions and
       the following disclaimer in the documentation and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors may be used to endorse or
       promote products derived from this software without specific prior written permission.

      THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
    INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
    DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
    SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
    SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
    WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
    OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *********************************************************************************************************************/

/* Define to prevent recursive inclusion -----------------------------------------------------------------------------*/

#ifndef __REG_ADC_H
#define __REG_ADC_H


/* Files includes ----------------------------------------------------------------------------------------------------*/
#include "core_starmc1.h"



/**
  * @brief ADC Base Address Definition
  */
#define  ADC1_BASE                                 0x40012400                                       /*!<Base Address: 0x40012400*/
#define  ADC2_BASE                                 0x40012800                                       /*!<Base Address: 0x40012800*/
#define  ADC3_BASE                                 0x40014C00                                       /*!<Base Address: 0x40014C00*/

/**
  * @brief ADC Register Structure Definition
  */
typedef struct
{
    __IO uint32_t ADDATA;                         /*!<ADC Data Register                              offset: 0x00       */
    __IO uint32_t ADCFG;                          /*!<ADC Configuration Register                     offset: 0x04       */
    __IO uint32_t ADCR;                           /*!<ADC Control Register                           offset: 0x08       */
    __IO uint32_t ADCHS;                          /*!<ADC Channel Selection Register                 offset: 0x0C       */
    __IO uint32_t ADCMPR;                         /*!<ADC Analog Watchdog Compare Register           offset: 0x10       */
    __IO uint32_t ADSTA;                          /*!<ADC Status Register                            offset: 0x14       */
    __IO uint32_t ADDR0;                          /*!<ADC Channel Data Register                      offset: 0x18       */
    __IO uint32_t ADDR1;                          /*!<ADC Channel Data Register                      offset: 0x1C       */
    __IO uint32_t ADDR2;                          /*!<ADC Channel Data Register                      offset: 0x20       */
    __IO uint32_t ADDR3;                          /*!<ADC Channel Data Register                      offset: 0x24       */
    __IO uint32_t ADDR4;                          /*!<ADC Channel Data Register                      offset: 0x28       */
    __IO uint32_t ADDR5;                          /*!<ADC Channel Data Register                      offset: 0x2C       */
    __IO uint32_t ADDR6;                          /*!<ADC Channel Data Register                      offset: 0x30       */
    __IO uint32_t ADDR7;                          /*!<ADC Channel Data Register                      offset: 0x34       */
    __IO uint32_t ADDR8;                          /*!<ADC Channel Data Register                      offset: 0x38       */
    __IO uint32_t ADDR9;                          /*!<ADC Channel Data Register                      offset: 0x3C       */
    __IO uint32_t ADDR10;                         /*!<ADC Channel Data Register                      offset: 0x40       */
    __IO uint32_t ADDR11;                         /*!<ADC Channel Data Register                      offset: 0x44       */
    __IO uint32_t ADDR12;                         /*!<ADC Channel Data Register                      offset: 0x48       */
    __IO uint32_t ADDR13;                         /*!<ADC Channel Data Register                      offset: 0x4C       */
    __IO uint32_t ADDR14;                         /*!<ADC Channel Data Register                      offset: 0x50       */
    __IO uint32_t ADDR15;                         /*!<ADC Channel Data Register                      offset: 0x54       */
    __IO uint32_t ADSTA_EXT;                      /*!<ADC Extended State Register                    offset: 0x58       */
    __IO uint32_t CHANY0;                         /*!<ADC Any Channel Selection Register 0           offset: 0x5C       */
    __IO uint32_t CHANY1;                         /*!<ADC Any Channel Selection Register 1           offset: 0x60       */
    __IO uint32_t ANY_CFG;                        /*!<ADC Any Channel Configuration Register         offset: 0x64       */
    __IO uint32_t ANY_CR;                         /*!<ADC Any Channel Control Register               offset: 0x68       */
    __IO uint32_t ADCFG2;                         /*!<ADC Configuration Register 2                   offset: 0x6C       */
    __IO uint32_t SMPR1;                          /*!<ADC Sample Configuration Register 1            offset: 0x70       */
    __IO uint32_t SMPR2;                          /*!<ADC Sample Configuration Register 2            offset: 0x74       */
    __IO uint32_t SMPR3;                          /*!<ADC Sample Configuration Register 3            offset: 0x78       */
    __IO uint32_t JOFR0;                          /*!<ADC Injected Channel Data Offset Register      offset: 0x7C       */
    __IO uint32_t JOFR1;                          /*!<ADC Injected Channel Data Offset Register      offset: 0x80       */
    __IO uint32_t JOFR2;                          /*!<ADC Injected Channel Data Offset Register      offset: 0x84       */
    __IO uint32_t JOFR3;                          /*!<ADC Injected Channel Data Offset Register      offset: 0x88       */
    __IO uint32_t JSQR;                           /*!<ADC Injected Sequence Register                 offset: 0x8C       */
    __IO uint32_t JADDATA;                        /*!<ADC Injected Data Register                     offset: 0x90       */
    __IO uint32_t CORRS;                          /*!<                                               offset: 0x94       */
    __IO uint32_t CORRD;                          /*!<                                               offset: 0x98       */
    __IO uint32_t CORRP;                          /*!<                                               offset: 0x9C       */
    __IO uint32_t RESERVED0xA0[4];                /*!<                                               offset: 0xA0~0xAC  */
    __IO uint32_t JDR0;                           /*!<                                               offset: 0xB0       */
    __IO uint32_t JDR1;                           /*!<                                               offset: 0xB4       */
    __IO uint32_t JDR2;                           /*!<                                               offset: 0xB8       */
    __IO uint32_t JDR3;                           /*!<                                               offset: 0xBC       */
} ADC_TypeDef;

/**
  * @brief ADC type pointer Definition
  */
#define ADC1                                      ((ADC_TypeDef *)ADC1_BASE)
#define ADC2                                      ((ADC_TypeDef *)ADC2_BASE)
#define ADC3                                      ((ADC_TypeDef *)ADC3_BASE)

/**
  * @brief ADC_ADDATA Register Bit Definition
  */
#define  ADC_ADDATA_DATA_Pos                      (0)
#define  ADC_ADDATA_DATA_Msk                      (0xFFFFU << ADC_ADDATA_DATA_Pos)                  /*!<12-bit A/D conversion result from the current channel (Conversion Data)*/
#define  ADC_ADDATA_DATA                          ADC_ADDATA_DATA_Msk
#define  ADC_ADDATA_DATA_Bit0                     (0x0001U << ADC_ADDATA_DATA_Pos) 
#define  ADC_ADDATA_DATA_Bit1                     (0x0002U << ADC_ADDATA_DATA_Pos) 
#define  ADC_ADDATA_DATA_Bit2                     (0x0004U << ADC_ADDATA_DATA_Pos) 
#define  ADC_ADDATA_DATA_Bit3                     (0x0008U << ADC_ADDATA_DATA_Pos) 
#define  ADC_ADDATA_DATA_Bit4                     (0x0010U << ADC_ADDATA_DATA_Pos) 
#define  ADC_ADDATA_DATA_Bit5                     (0x0020U << ADC_ADDATA_DATA_Pos) 
#define  ADC_ADDATA_DATA_Bit6                     (0x0040U << ADC_ADDATA_DATA_Pos) 
#define  ADC_ADDATA_DATA_Bit7                     (0x0080U << ADC_ADDATA_DATA_Pos) 
#define  ADC_ADDATA_DATA_Bit8                     (0x0100U << ADC_ADDATA_DATA_Pos) 
#define  ADC_ADDATA_DATA_Bit9                     (0x0200U << ADC_ADDATA_DATA_Pos) 
#define  ADC_ADDATA_DATA_Bit10                    (0x0400U << ADC_ADDATA_DATA_Pos) 
#define  ADC_ADDATA_DATA_Bit11                    (0x0800U << ADC_ADDATA_DATA_Pos) 
#define  ADC_ADDATA_DATA_Bit12                    (0x1000U << ADC_ADDATA_DATA_Pos) 
#define  ADC_ADDATA_DATA_Bit13                    (0x2000U << ADC_ADDATA_DATA_Pos) 
#define  ADC_ADDATA_DATA_Bit14                    (0x4000U << ADC_ADDATA_DATA_Pos) 
#define  ADC_ADDATA_DATA_Bit15                    (0x8000U << ADC_ADDATA_DATA_Pos) 
#define  ADC_ADDATA_CHANNELSEL_Pos                (16)
#define  ADC_ADDATA_CHANNELSEL_Msk                (0xFU << ADC_ADDATA_CHANNELSEL_Pos)               /*!<Channel selection For Low Bits*/
#define  ADC_ADDATA_CHANNELSEL                    ADC_ADDATA_CHANNELSEL_Msk
#define  ADC_ADDATA_CHANNELSEL_Bit0               (0x1U << ADC_ADDATA_CHANNELSEL_Pos) 
#define  ADC_ADDATA_CHANNELSEL_Bit1               (0x2U << ADC_ADDATA_CHANNELSEL_Pos) 
#define  ADC_ADDATA_CHANNELSEL_Bit2               (0x4U << ADC_ADDATA_CHANNELSEL_Pos) 
#define  ADC_ADDATA_CHANNELSEL_Bit3               (0x8U << ADC_ADDATA_CHANNELSEL_Pos) 
#define  ADC_ADDATA_OVERRUN_Pos                   (20)
#define  ADC_ADDATA_OVERRUN_Msk                   (0x1U << ADC_ADDATA_OVERRUN_Pos)                  /*!<Data overrun flag (read-only)*/
#define  ADC_ADDATA_OVERRUN                       ADC_ADDATA_OVERRUN_Msk
#define  ADC_ADDATA_VALID_Pos                     (21)
#define  ADC_ADDATA_VALID_Msk                     (0x1U << ADC_ADDATA_VALID_Pos)                    /*!<Valid flag for data (read-only)*/
#define  ADC_ADDATA_VALID                         ADC_ADDATA_VALID_Msk
#define  ADC_ADDATA_CHANNELSELH_Pos               (22)
#define  ADC_ADDATA_CHANNELSELH_Msk               (0x1U << ADC_ADDATA_CHANNELSELH_Pos)              /*!<*/
#define  ADC_ADDATA_CHANNELSELH                   ADC_ADDATA_CHANNELSELH_Msk

/**
  * @brief ADC_ADCFG Register Bit Definition
  */
#define  ADC_ADCFG_ADEN_Pos                       (0)
#define  ADC_ADCFG_ADEN_Msk                       (0x1U << ADC_ADCFG_ADEN_Pos)                      /*!<A/D conversion enable (ADC enable)*/
#define  ADC_ADCFG_ADEN                           ADC_ADCFG_ADEN_Msk
#define  ADC_ADCFG_AWDEN_Pos                      (1)
#define  ADC_ADCFG_AWDEN_Msk                      (0x1U << ADC_ADCFG_AWDEN_Pos)                     /*!<Analog watchdog enable on non-injected channels*/
#define  ADC_ADCFG_AWDEN                          ADC_ADCFG_AWDEN_Msk
#define  ADC_ADCFG_TSEN_Pos                       (2)
#define  ADC_ADCFG_TSEN_Msk                       (0x1U << ADC_ADCFG_TSEN_Pos)                      /*!<Temperature Sensor Enable*/
#define  ADC_ADCFG_TSEN                           ADC_ADCFG_TSEN_Msk
#define  ADC_ADCFG_VSEN_Pos                       (3)
#define  ADC_ADCFG_VSEN_Msk                       (0x1U << ADC_ADCFG_VSEN_Pos)                      /*!<Internal reference voltage enable (Voltage Sensor enable)*/
#define  ADC_ADCFG_VSEN                           ADC_ADCFG_VSEN_Msk
#define  ADC_ADCFG_RSLTCTL_Pos                    (7)
#define  ADC_ADCFG_RSLTCTL_Msk                    (0x7U << ADC_ADCFG_RSLTCTL_Pos)                   /*!<ADC conversion data resolution selection Single Conversion and Differential Conversion*/
#define  ADC_ADCFG_RSLTCTL                        ADC_ADCFG_RSLTCTL_Msk
#define  ADC_ADCFG_RSLTCTL_Bit0                   (0x1U << ADC_ADCFG_RSLTCTL_Pos) 
#define  ADC_ADCFG_RSLTCTL_Bit1                   (0x2U << ADC_ADCFG_RSLTCTL_Pos) 
#define  ADC_ADCFG_RSLTCTL_Bit2                   (0x4U << ADC_ADCFG_RSLTCTL_Pos) 
#define  ADC_ADCFG_JAWDEN_Pos                     (16)
#define  ADC_ADCFG_JAWDEN_Msk                     (0x1U << ADC_ADCFG_JAWDEN_Pos)                    /*!<A/D Analog Watchdog Enable for Injected Channels*/
#define  ADC_ADCFG_JAWDEN                         ADC_ADCFG_JAWDEN_Msk

/**
  * @brief ADC_ADCR Register Bit Definition
  */
#define  ADC_ADCR_EOSIE_Pos                       (0)
#define  ADC_ADCR_EOSIE_Msk                       (0x1U << ADC_ADCR_EOSIE_Pos)                      /*!<Interrupt Enable for End of Sequence on non-injected channels*/
#define  ADC_ADCR_EOSIE                           ADC_ADCR_EOSIE_Msk
#define  ADC_ADCR_AWDIE_Pos                       (1)
#define  ADC_ADCR_AWDIE_Msk                       (0x1U << ADC_ADCR_AWDIE_Pos)                      /*!<Interrupt Enable of Analog Watchdog*/
#define  ADC_ADCR_AWDIE                           ADC_ADCR_AWDIE_Msk
#define  ADC_ADCR_TRGEN_Pos                       (2)
#define  ADC_ADCR_TRGEN_Msk                       (0x1U << ADC_ADCR_TRGEN_Pos)                      /*!<External Hardware Trigger Sources Enable*/
#define  ADC_ADCR_TRGEN                           ADC_ADCR_TRGEN_Msk
#define  ADC_ADCR_DMAEN_Pos                       (3)
#define  ADC_ADCR_DMAEN_Msk                       (0x1U << ADC_ADCR_DMAEN_Pos)                      /*!<Direct Memory Access Enable*/
#define  ADC_ADCR_DMAEN                           ADC_ADCR_DMAEN_Msk
#define  ADC_ADCR_ADST_Pos                        (8)
#define  ADC_ADCR_ADST_Msk                        (0x1U << ADC_ADCR_ADST_Pos)                       /*!<A/D conversion start*/
#define  ADC_ADCR_ADST                            ADC_ADCR_ADST_Msk
#define  ADC_ADCR_ADMD_Pos                        (9)
#define  ADC_ADCR_ADMD_Msk                        (0x3U << ADC_ADCR_ADMD_Pos)                       /*!<A/D conversion mode (ADC Mode)*/
#define  ADC_ADCR_ADMD                            ADC_ADCR_ADMD_Msk
#define  ADC_ADCR_ADMD_Bit0                       (0x1U << ADC_ADCR_ADMD_Pos) 
#define  ADC_ADCR_ADMD_Bit1                       (0x2U << ADC_ADCR_ADMD_Pos) 
#define  ADC_ADCR_ALIGN_Pos                       (11)
#define  ADC_ADCR_ALIGN_Msk                       (0x1U << ADC_ADCR_ALIGN_Pos)                      /*!<Data Alignment style*/
#define  ADC_ADCR_ALIGN                           ADC_ADCR_ALIGN_Msk
#define  ADC_ADCR_CMPCHL_Pos                      (12)
#define  ADC_ADCR_CMPCHL_Msk                      (0xFU << ADC_ADCR_CMPCHL_Pos)                     /*!<Compare Channel Selection For Analog Watchdog*/
#define  ADC_ADCR_CMPCHL                          ADC_ADCR_CMPCHL_Msk
#define  ADC_ADCR_CMPCHL_Bit0                     (0x1U << ADC_ADCR_CMPCHL_Pos) 
#define  ADC_ADCR_CMPCHL_Bit1                     (0x2U << ADC_ADCR_CMPCHL_Pos) 
#define  ADC_ADCR_CMPCHL_Bit2                     (0x4U << ADC_ADCR_CMPCHL_Pos) 
#define  ADC_ADCR_CMPCHL_Bit3                     (0x8U << ADC_ADCR_CMPCHL_Pos) 
#define  ADC_ADCR_SCANDIR_Pos                     (16)
#define  ADC_ADCR_SCANDIR_Msk                     (0x1U << ADC_ADCR_SCANDIR_Pos)                    /*!<ADC Channel Scan Direction Only valid for normal channel conversion*/
#define  ADC_ADCR_SCANDIR                         ADC_ADCR_SCANDIR_Msk
#define  ADC_ADCR_TRGSHIFT_Pos                    (19)
#define  ADC_ADCR_TRGSHIFT_Msk                    (0x7U << ADC_ADCR_TRGSHIFT_Pos)                   /*!<External Trigger Sources Shift For Sample After a trigger event is generated, the sampling starts after a delay of N PCLK2 clock cycles (N=1, 2, 3...).*/
#define  ADC_ADCR_TRGSHIFT                        ADC_ADCR_TRGSHIFT_Msk
#define  ADC_ADCR_TRGSHIFT_Bit0                   (0x1U << ADC_ADCR_TRGSHIFT_Pos) 
#define  ADC_ADCR_TRGSHIFT_Bit1                   (0x2U << ADC_ADCR_TRGSHIFT_Pos) 
#define  ADC_ADCR_TRGSHIFT_Bit2                   (0x4U << ADC_ADCR_TRGSHIFT_Pos) 
#define  ADC_ADCR_TRG_EDGE_Pos                    (24)
#define  ADC_ADCR_TRG_EDGE_Msk                    (0x3U << ADC_ADCR_TRG_EDGE_Pos)                   /*!<Trigger Sources Edge Selection*/
#define  ADC_ADCR_TRG_EDGE                        ADC_ADCR_TRG_EDGE_Msk
#define  ADC_ADCR_TRG_EDGE_Bit0                   (0x1U << ADC_ADCR_TRG_EDGE_Pos) 
#define  ADC_ADCR_TRG_EDGE_Bit1                   (0x2U << ADC_ADCR_TRG_EDGE_Pos) 
#define  ADC_ADCR_EOSMPIE_Pos                     (26)
#define  ADC_ADCR_EOSMPIE_Msk                     (0x1U << ADC_ADCR_EOSMPIE_Pos)                    /*!<Interrupt Enable for End of Sample*/
#define  ADC_ADCR_EOSMPIE                         ADC_ADCR_EOSMPIE_Msk
#define  ADC_ADCR_EOCIE_Pos                       (27)
#define  ADC_ADCR_EOCIE_Msk                       (0x1U << ADC_ADCR_EOCIE_Pos)                      /*!<Interrupt Enable for End of Conversion*/
#define  ADC_ADCR_EOCIE                           ADC_ADCR_EOCIE_Msk
#define  ADC_ADCR_CMPCHH_Pos                      (28)
#define  ADC_ADCR_CMPCHH_Msk                      (0x1U << ADC_ADCR_CMPCHH_Pos)                     /*!<*/
#define  ADC_ADCR_CMPCHH                          ADC_ADCR_CMPCHH_Msk

/**
  * @brief ADC_ADCHS Register Bit Definition
  */
#define  ADC_ADCHS_CHEN0_Pos                      (0)
#define  ADC_ADCHS_CHEN0_Msk                      (0x1U << ADC_ADCHS_CHEN0_Pos)                     /*!<Analog Input Channel 0 Enable*/
#define  ADC_ADCHS_CHEN0                          ADC_ADCHS_CHEN0_Msk
#define  ADC_ADCHS_CHEN1_Pos                      (1)
#define  ADC_ADCHS_CHEN1_Msk                      (0x1U << ADC_ADCHS_CHEN1_Pos)                     /*!<Analog Input Channel 1 Enable*/
#define  ADC_ADCHS_CHEN1                          ADC_ADCHS_CHEN1_Msk
#define  ADC_ADCHS_CHEN2_Pos                      (2)
#define  ADC_ADCHS_CHEN2_Msk                      (0x1U << ADC_ADCHS_CHEN2_Pos)                     /*!<Analog Input Channel 2 Enable*/
#define  ADC_ADCHS_CHEN2                          ADC_ADCHS_CHEN2_Msk
#define  ADC_ADCHS_CHEN3_Pos                      (3)
#define  ADC_ADCHS_CHEN3_Msk                      (0x1U << ADC_ADCHS_CHEN3_Pos)                     /*!<Analog Input Channel 3 Enable*/
#define  ADC_ADCHS_CHEN3                          ADC_ADCHS_CHEN3_Msk
#define  ADC_ADCHS_CHEN4_Pos                      (4)
#define  ADC_ADCHS_CHEN4_Msk                      (0x1U << ADC_ADCHS_CHEN4_Pos)                     /*!<Analog Input Channel 4 Enable*/
#define  ADC_ADCHS_CHEN4                          ADC_ADCHS_CHEN4_Msk
#define  ADC_ADCHS_CHEN5_Pos                      (5)
#define  ADC_ADCHS_CHEN5_Msk                      (0x1U << ADC_ADCHS_CHEN5_Pos)                     /*!<Analog Input Channel 5 Enable*/
#define  ADC_ADCHS_CHEN5                          ADC_ADCHS_CHEN5_Msk
#define  ADC_ADCHS_CHEN6_Pos                      (6)
#define  ADC_ADCHS_CHEN6_Msk                      (0x1U << ADC_ADCHS_CHEN6_Pos)                     /*!<Analog Input Channel 6 Enable*/
#define  ADC_ADCHS_CHEN6                          ADC_ADCHS_CHEN6_Msk
#define  ADC_ADCHS_CHEN7_Pos                      (7)
#define  ADC_ADCHS_CHEN7_Msk                      (0x1U << ADC_ADCHS_CHEN7_Pos)                     /*!<Analog Input Channel 7 Enable*/
#define  ADC_ADCHS_CHEN7                          ADC_ADCHS_CHEN7_Msk
#define  ADC_ADCHS_CHEN8_Pos                      (8)
#define  ADC_ADCHS_CHEN8_Msk                      (0x1U << ADC_ADCHS_CHEN8_Pos)                     /*!<Analog Input Channel 8 Enable*/
#define  ADC_ADCHS_CHEN8                          ADC_ADCHS_CHEN8_Msk
#define  ADC_ADCHS_CHEN9_Pos                      (9)
#define  ADC_ADCHS_CHEN9_Msk                      (0x1U << ADC_ADCHS_CHEN9_Pos)                     /*!<Analog Input Channel 9 Enable*/
#define  ADC_ADCHS_CHEN9                          ADC_ADCHS_CHEN9_Msk
#define  ADC_ADCHS_CHEN10_Pos                     (10)
#define  ADC_ADCHS_CHEN10_Msk                     (0x1U << ADC_ADCHS_CHEN10_Pos)                    /*!<Analog Input Channel 10 Enable*/
#define  ADC_ADCHS_CHEN10                         ADC_ADCHS_CHEN10_Msk
#define  ADC_ADCHS_CHEN11_Pos                     (11)
#define  ADC_ADCHS_CHEN11_Msk                     (0x1U << ADC_ADCHS_CHEN11_Pos)                    /*!<Analog Input Channel 11 Enable*/
#define  ADC_ADCHS_CHEN11                         ADC_ADCHS_CHEN11_Msk
#define  ADC_ADCHS_CHEN12_Pos                     (12)
#define  ADC_ADCHS_CHEN12_Msk                     (0x1U << ADC_ADCHS_CHEN12_Pos)                    /*!<Analog Input Channel 12 Enable*/
#define  ADC_ADCHS_CHEN12                         ADC_ADCHS_CHEN12_Msk
#define  ADC_ADCHS_CHEN13_Pos                     (13)
#define  ADC_ADCHS_CHEN13_Msk                     (0x1U << ADC_ADCHS_CHEN13_Pos)                    /*!<Analog Input Channel 13 Enable*/
#define  ADC_ADCHS_CHEN13                         ADC_ADCHS_CHEN13_Msk
#define  ADC_ADCHS_CHEN14_Pos                     (14)
#define  ADC_ADCHS_CHEN14_Msk                     (0x1U << ADC_ADCHS_CHEN14_Pos)                    /*!<Analog Input Channel 14 Enable*/
#define  ADC_ADCHS_CHEN14                         ADC_ADCHS_CHEN14_Msk
#define  ADC_ADCHS_CHEN15_Pos                     (15)
#define  ADC_ADCHS_CHEN15_Msk                     (0x1U << ADC_ADCHS_CHEN15_Pos)                    /*!<Analog Input Channel 15 Enable*/
#define  ADC_ADCHS_CHEN15                         ADC_ADCHS_CHEN15_Msk

