SkydiverMCU/mcu-iap-demo/STAR-MC1/MM32F5370/USB_Custom_HID/MM32F5370_HID_Bootloader/Device/MM32F5370/Include/reg_adc.h
/**
  * @brief ADC_ADCMPR Register Bit Definition
  */
#define  ADC_ADCMPR_CMPLDATA_Pos                  (0)
#define  ADC_ADCMPR_CMPLDATA_Msk                  (0xFFFU << ADC_ADCMPR_CMPLDATA_Pos)               /*!<Compare Low Threshold Data For Analog Watchdog*/
#define  ADC_ADCMPR_CMPLDATA                      ADC_ADCMPR_CMPLDATA_Msk
#define  ADC_ADCMPR_CMPLDATA_Bit0                 (0x001U << ADC_ADCMPR_CMPLDATA_Pos) 
#define  ADC_ADCMPR_CMPLDATA_Bit1                 (0x002U << ADC_ADCMPR_CMPLDATA_Pos) 
#define  ADC_ADCMPR_CMPLDATA_Bit2                 (0x004U << ADC_ADCMPR_CMPLDATA_Pos) 
#define  ADC_ADCMPR_CMPLDATA_Bit3                 (0x008U << ADC_ADCMPR_CMPLDATA_Pos) 
#define  ADC_ADCMPR_CMPLDATA_Bit4                 (0x010U << ADC_ADCMPR_CMPLDATA_Pos) 
#define  ADC_ADCMPR_CMPLDATA_Bit5                 (0x020U << ADC_ADCMPR_CMPLDATA_Pos) 
#define  ADC_ADCMPR_CMPLDATA_Bit6                 (0x040U << ADC_ADCMPR_CMPLDATA_Pos) 
#define  ADC_ADCMPR_CMPLDATA_Bit7                 (0x080U << ADC_ADCMPR_CMPLDATA_Pos) 
#define  ADC_ADCMPR_CMPLDATA_Bit8                 (0x100U << ADC_ADCMPR_CMPLDATA_Pos) 
#define  ADC_ADCMPR_CMPLDATA_Bit9                 (0x200U << ADC_ADCMPR_CMPLDATA_Pos) 
#define  ADC_ADCMPR_CMPLDATA_Bit10                (0x400U << ADC_ADCMPR_CMPLDATA_Pos) 
#define  ADC_ADCMPR_CMPLDATA_Bit11                (0x800U << ADC_ADCMPR_CMPLDATA_Pos) 
#define  ADC_ADCMPR_CMPHDATA_Pos                  (16)
#define  ADC_ADCMPR_CMPHDATA_Msk                  (0xFFFU << ADC_ADCMPR_CMPHDATA_Pos)               /*!<Compare High Threshold Data For Analog Watchdog*/
#define  ADC_ADCMPR_CMPHDATA                      ADC_ADCMPR_CMPHDATA_Msk
#define  ADC_ADCMPR_CMPHDATA_Bit0                 (0x001U << ADC_ADCMPR_CMPHDATA_Pos) 
#define  ADC_ADCMPR_CMPHDATA_Bit1                 (0x002U << ADC_ADCMPR_CMPHDATA_Pos) 
#define  ADC_ADCMPR_CMPHDATA_Bit2                 (0x004U << ADC_ADCMPR_CMPHDATA_Pos) 
#define  ADC_ADCMPR_CMPHDATA_Bit3                 (0x008U << ADC_ADCMPR_CMPHDATA_Pos) 
#define  ADC_ADCMPR_CMPHDATA_Bit4                 (0x010U << ADC_ADCMPR_CMPHDATA_Pos) 
#define  ADC_ADCMPR_CMPHDATA_Bit5                 (0x020U << ADC_ADCMPR_CMPHDATA_Pos) 
#define  ADC_ADCMPR_CMPHDATA_Bit6                 (0x040U << ADC_ADCMPR_CMPHDATA_Pos) 
#define  ADC_ADCMPR_CMPHDATA_Bit7                 (0x080U << ADC_ADCMPR_CMPHDATA_Pos) 
#define  ADC_ADCMPR_CMPHDATA_Bit8                 (0x100U << ADC_ADCMPR_CMPHDATA_Pos) 
#define  ADC_ADCMPR_CMPHDATA_Bit9                 (0x200U << ADC_ADCMPR_CMPHDATA_Pos) 
#define  ADC_ADCMPR_CMPHDATA_Bit10                (0x400U << ADC_ADCMPR_CMPHDATA_Pos) 
#define  ADC_ADCMPR_CMPHDATA_Bit11                (0x800U << ADC_ADCMPR_CMPHDATA_Pos) 

/**
  * @brief ADC_ADSTA Register Bit Definition
  */
#define  ADC_ADSTA_EOSIF_Pos                      (0)
#define  ADC_ADSTA_EOSIF_Msk                      (0x1U << ADC_ADSTA_EOSIF_Pos)                     /*!<End of Sequential Conversion*/
#define  ADC_ADSTA_EOSIF                          ADC_ADSTA_EOSIF_Msk
#define  ADC_ADSTA_AWDIF_Pos                      (1)
#define  ADC_ADSTA_AWDIF_Msk                      (0x1U << ADC_ADSTA_AWDIF_Pos)                     /*!<Analog Watchdog Flag*/
#define  ADC_ADSTA_AWDIF                          ADC_ADSTA_AWDIF_Msk
#define  ADC_ADSTA_BUSY_Pos                       (2)
#define  ADC_ADSTA_BUSY_Msk                       (0x1U << ADC_ADSTA_BUSY_Pos)                      /*!<Non-Injected Conversion Busy/Idle*/
#define  ADC_ADSTA_BUSY                           ADC_ADSTA_BUSY_Msk
#define  ADC_ADSTA_CHANNELH_Pos                   (3)
#define  ADC_ADSTA_CHANNELH_Msk                   (0x1U << ADC_ADSTA_CHANNELH_Pos)                  /*!<Current Convert Channel For High Bits*/
#define  ADC_ADSTA_CHANNELH                       ADC_ADSTA_CHANNELH_Msk
#define  ADC_ADSTA_CHANNELL_Pos                   (4)
#define  ADC_ADSTA_CHANNELL_Msk                   (0xFU << ADC_ADSTA_CHANNELL_Pos)                  /*!<Current Convert Channel For Low Bits*/
#define  ADC_ADSTA_CHANNELL                       ADC_ADSTA_CHANNELL_Msk
#define  ADC_ADSTA_CHANNELL_Bit0                  (0x1U << ADC_ADSTA_CHANNELL_Pos) 
#define  ADC_ADSTA_CHANNELL_Bit1                  (0x2U << ADC_ADSTA_CHANNELL_Pos) 
#define  ADC_ADSTA_CHANNELL_Bit2                  (0x4U << ADC_ADSTA_CHANNELL_Pos) 
#define  ADC_ADSTA_CHANNELL_Bit3                  (0x8U << ADC_ADSTA_CHANNELL_Pos) 
#define  ADC_ADSTA_VALID_Pos                      (8)
#define  ADC_ADSTA_VALID_Msk                      (0xFFFU << ADC_ADSTA_VALID_Pos)                   /*!<Valid flag for channel 0 to channel 11 (Valid Flag)*/
#define  ADC_ADSTA_VALID                          ADC_ADSTA_VALID_Msk
#define  ADC_ADSTA_VALID_Bit0                     (0x001U << ADC_ADSTA_VALID_Pos) 
#define  ADC_ADSTA_VALID_Bit1                     (0x002U << ADC_ADSTA_VALID_Pos) 
#define  ADC_ADSTA_VALID_Bit2                     (0x004U << ADC_ADSTA_VALID_Pos) 
#define  ADC_ADSTA_VALID_Bit3                     (0x008U << ADC_ADSTA_VALID_Pos) 
#define  ADC_ADSTA_VALID_Bit4                     (0x010U << ADC_ADSTA_VALID_Pos) 
#define  ADC_ADSTA_VALID_Bit5                     (0x020U << ADC_ADSTA_VALID_Pos) 
#define  ADC_ADSTA_VALID_Bit6                     (0x040U << ADC_ADSTA_VALID_Pos) 
#define  ADC_ADSTA_VALID_Bit7                     (0x080U << ADC_ADSTA_VALID_Pos) 
#define  ADC_ADSTA_VALID_Bit8                     (0x100U << ADC_ADSTA_VALID_Pos) 
#define  ADC_ADSTA_VALID_Bit9                     (0x200U << ADC_ADSTA_VALID_Pos) 
#define  ADC_ADSTA_VALID_Bit10                    (0x400U << ADC_ADSTA_VALID_Pos) 
#define  ADC_ADSTA_VALID_Bit11                    (0x800U << ADC_ADSTA_VALID_Pos) 
#define  ADC_ADSTA_OVERRUN_Pos                    (20)
#define  ADC_ADSTA_OVERRUN_Msk                    (0xFFFU << ADC_ADSTA_OVERRUN_Pos)                 /*!<Data overrun flag for channel 0 to channel 11 (Overrun Flag)*/
#define  ADC_ADSTA_OVERRUN                        ADC_ADSTA_OVERRUN_Msk
#define  ADC_ADSTA_OVERRUN_Bit0                   (0x001U << ADC_ADSTA_OVERRUN_Pos) 
#define  ADC_ADSTA_OVERRUN_Bit1                   (0x002U << ADC_ADSTA_OVERRUN_Pos) 
#define  ADC_ADSTA_OVERRUN_Bit2                   (0x004U << ADC_ADSTA_OVERRUN_Pos) 
#define  ADC_ADSTA_OVERRUN_Bit3                   (0x008U << ADC_ADSTA_OVERRUN_Pos) 
#define  ADC_ADSTA_OVERRUN_Bit4                   (0x010U << ADC_ADSTA_OVERRUN_Pos) 
#define  ADC_ADSTA_OVERRUN_Bit5                   (0x020U << ADC_ADSTA_OVERRUN_Pos) 
#define  ADC_ADSTA_OVERRUN_Bit6                   (0x040U << ADC_ADSTA_OVERRUN_Pos) 
#define  ADC_ADSTA_OVERRUN_Bit7                   (0x080U << ADC_ADSTA_OVERRUN_Pos) 
#define  ADC_ADSTA_OVERRUN_Bit8                   (0x100U << ADC_ADSTA_OVERRUN_Pos) 
#define  ADC_ADSTA_OVERRUN_Bit9                   (0x200U << ADC_ADSTA_OVERRUN_Pos) 
#define  ADC_ADSTA_OVERRUN_Bit10                  (0x400U << ADC_ADSTA_OVERRUN_Pos) 
#define  ADC_ADSTA_OVERRUN_Bit11                  (0x800U << ADC_ADSTA_OVERRUN_Pos) 

/**
  * @brief ADC_ADDR Register Bit Definition
  */
#define  ADC_ADDR_DATA_Pos                        (0)
#define  ADC_ADDR_DATA_Msk                        (0xFFFFU << ADC_ADDR_DATA_Pos)                    /*!<12-bit A/D conversion result from the channel n (Conversion Data) The alignment style is selected via software.*/
#define  ADC_ADDR_DATA                            ADC_ADDR_DATA_Msk
#define  ADC_ADDR_DATA_Bit0                       (0x0001U << ADC_ADDR_DATA_Pos) 
#define  ADC_ADDR_DATA_Bit1                       (0x0002U << ADC_ADDR_DATA_Pos) 
#define  ADC_ADDR_DATA_Bit2                       (0x0004U << ADC_ADDR_DATA_Pos) 
#define  ADC_ADDR_DATA_Bit3                       (0x0008U << ADC_ADDR_DATA_Pos) 
#define  ADC_ADDR_DATA_Bit4                       (0x0010U << ADC_ADDR_DATA_Pos) 
#define  ADC_ADDR_DATA_Bit5                       (0x0020U << ADC_ADDR_DATA_Pos) 
#define  ADC_ADDR_DATA_Bit6                       (0x0040U << ADC_ADDR_DATA_Pos) 
#define  ADC_ADDR_DATA_Bit7                       (0x0080U << ADC_ADDR_DATA_Pos) 
#define  ADC_ADDR_DATA_Bit8                       (0x0100U << ADC_ADDR_DATA_Pos) 
#define  ADC_ADDR_DATA_Bit9                       (0x0200U << ADC_ADDR_DATA_Pos) 
#define  ADC_ADDR_DATA_Bit10                      (0x0400U << ADC_ADDR_DATA_Pos) 
#define  ADC_ADDR_DATA_Bit11                      (0x0800U << ADC_ADDR_DATA_Pos) 
#define  ADC_ADDR_DATA_Bit12                      (0x1000U << ADC_ADDR_DATA_Pos) 
#define  ADC_ADDR_DATA_Bit13                      (0x2000U << ADC_ADDR_DATA_Pos) 
#define  ADC_ADDR_DATA_Bit14                      (0x4000U << ADC_ADDR_DATA_Pos) 
#define  ADC_ADDR_DATA_Bit15                      (0x8000U << ADC_ADDR_DATA_Pos) 
#define  ADC_ADDR_OVERRUN_Pos                     (20)
#define  ADC_ADDR_OVERRUN_Msk                     (0x1U << ADC_ADDR_OVERRUN_Pos)                    /*!<Data overrun flag (read-only)*/
#define  ADC_ADDR_OVERRUN                         ADC_ADDR_OVERRUN_Msk
#define  ADC_ADDR_VALID_Pos                       (21)
#define  ADC_ADDR_VALID_Msk                       (0x1U << ADC_ADDR_VALID_Pos)                      /*!<Valid flag (read-only)*/
#define  ADC_ADDR_VALID                           ADC_ADDR_VALID_Msk

/**
  * @brief ADC_ADSTA_EXT Register Bit Definition
  */
#define  ADC_ADSTA_EXT_VALID_Pos                  (0)
#define  ADC_ADSTA_EXT_VALID_Msk                  (0xFU << ADC_ADSTA_EXT_VALID_Pos)                 /*!<Valid flag for channel (Valid Flag)*/
#define  ADC_ADSTA_EXT_VALID                      ADC_ADSTA_EXT_VALID_Msk
#define  ADC_ADSTA_EXT_VALID_Bit0                 (0x1U << ADC_ADSTA_EXT_VALID_Pos) 
#define  ADC_ADSTA_EXT_VALID_Bit1                 (0x2U << ADC_ADSTA_EXT_VALID_Pos) 
#define  ADC_ADSTA_EXT_VALID_Bit2                 (0x4U << ADC_ADSTA_EXT_VALID_Pos) 
#define  ADC_ADSTA_EXT_VALID_Bit3                 (0x8U << ADC_ADSTA_EXT_VALID_Pos) 
#define  ADC_ADSTA_EXT_OVERRUN_Pos                (4)
#define  ADC_ADSTA_EXT_OVERRUN_Msk                (0xFU << ADC_ADSTA_EXT_OVERRUN_Pos)               /*!<Data overrun flag for channel (Overrun Flag)*/
#define  ADC_ADSTA_EXT_OVERRUN                    ADC_ADSTA_EXT_OVERRUN_Msk
#define  ADC_ADSTA_EXT_OVERRUN_Bit0               (0x1U << ADC_ADSTA_EXT_OVERRUN_Pos) 
#define  ADC_ADSTA_EXT_OVERRUN_Bit1               (0x2U << ADC_ADSTA_EXT_OVERRUN_Pos) 
#define  ADC_ADSTA_EXT_OVERRUN_Bit2               (0x4U << ADC_ADSTA_EXT_OVERRUN_Pos) 
#define  ADC_ADSTA_EXT_OVERRUN_Bit3               (0x8U << ADC_ADSTA_EXT_OVERRUN_Pos) 
#define  ADC_ADSTA_EXT_EOSMPIF_Pos                (16)
#define  ADC_ADSTA_EXT_EOSMPIF_Msk                (0x1U << ADC_ADSTA_EXT_EOSMPIF_Pos)               /*!<End of Sample Flag This bit is set by hardware at the end of sampling, and cleared by software.*/
#define  ADC_ADSTA_EXT_EOSMPIF                    ADC_ADSTA_EXT_EOSMPIF_Msk
#define  ADC_ADSTA_EXT_EOCIF_Pos                  (17)
#define  ADC_ADSTA_EXT_EOCIF_Msk                  (0x1U << ADC_ADSTA_EXT_EOCIF_Pos)                 /*!<End of Conversion Flag This bit is set by hardware at the end of conversion, and cleared by software.*/
#define  ADC_ADSTA_EXT_EOCIF                      ADC_ADSTA_EXT_EOCIF_Msk
#define  ADC_ADSTA_EXT_JEOSMPIF_Pos               (18)
#define  ADC_ADSTA_EXT_JEOSMPIF_Msk               (0x1U << ADC_ADSTA_EXT_JEOSMPIF_Pos)              /*!<End of Injected Sample Flag This bit is set by hardware at the end of sampling, and cleared by software.*/
#define  ADC_ADSTA_EXT_JEOSMPIF                   ADC_ADSTA_EXT_JEOSMPIF_Msk
#define  ADC_ADSTA_EXT_JEOCIF_Pos                 (19)
#define  ADC_ADSTA_EXT_JEOCIF_Msk                 (0x1U << ADC_ADSTA_EXT_JEOCIF_Pos)                /*!<End of Injected Conversion Flag This bit is set by hardware at the end of conversion, and cleared by software.*/
#define  ADC_ADSTA_EXT_JEOCIF                     ADC_ADSTA_EXT_JEOCIF_Msk
#define  ADC_ADSTA_EXT_JEOSIF_Pos                 (20)
#define  ADC_ADSTA_EXT_JEOSIF_Msk                 (0x1U << ADC_ADSTA_EXT_JEOSIF_Pos)                /*!<End of Injected Sequence Flag This bit is set by hardware at the end of sequential conversion, and cleared by software.*/
#define  ADC_ADSTA_EXT_JEOSIF                     ADC_ADSTA_EXT_JEOSIF_Msk
#define  ADC_ADSTA_EXT_JBUSY_Pos                  (21)
#define  ADC_ADSTA_EXT_JBUSY_Msk                  (0x1U << ADC_ADSTA_EXT_JBUSY_Pos)                 /*!<Injected Conversion Busy/Idle Flag*/
#define  ADC_ADSTA_EXT_JBUSY                      ADC_ADSTA_EXT_JBUSY_Msk
#define  ADC_ADSTA_EXT_EOCALIF_Pos                (24)
#define  ADC_ADSTA_EXT_EOCALIF_Msk                (0x1U << ADC_ADSTA_EXT_EOCALIF_Pos)               /*!<End of calibration interrupt flag*/
#define  ADC_ADSTA_EXT_EOCALIF                    ADC_ADSTA_EXT_EOCALIF_Msk
#define  ADC_ADSTA_EXT_CALBUSY_Pos                (25)
#define  ADC_ADSTA_EXT_CALBUSY_Msk                (0x1U << ADC_ADSTA_EXT_CALBUSY_Pos)               /*!<CALBUSY: Calibration mode busy/idle (Busy)*/
#define  ADC_ADSTA_EXT_CALBUSY                    ADC_ADSTA_EXT_CALBUSY_Msk
#define  ADC_ADSTA_EXT_FREOCIF_Pos                (26)
#define  ADC_ADSTA_EXT_FREOCIF_Msk                (0x1U << ADC_ADSTA_EXT_FREOCIF_Pos)               /*!<Calibration factor read/write data register end flag*/
#define  ADC_ADSTA_EXT_FREOCIF                    ADC_ADSTA_EXT_FREOCIF_Msk

/**
  * @brief ADC_CHANY0 Register Bit Definition
  */
#define  ADC_CHANY0_CHANY_SELL0_Pos               (0)
#define  ADC_CHANY0_CHANY_SELL0_Msk               (0xFU << ADC_CHANY0_CHANY_SELL0_Pos)              /*!<0th Conversion Select for Any Channel sequence For Low Bits*/
#define  ADC_CHANY0_CHANY_SELL0                   ADC_CHANY0_CHANY_SELL0_Msk
#define  ADC_CHANY0_CHANY_SELL0_Bit0              (0x1U << ADC_CHANY0_CHANY_SELL0_Pos) 
#define  ADC_CHANY0_CHANY_SELL0_Bit1              (0x2U << ADC_CHANY0_CHANY_SELL0_Pos) 
#define  ADC_CHANY0_CHANY_SELL0_Bit2              (0x4U << ADC_CHANY0_CHANY_SELL0_Pos) 
#define  ADC_CHANY0_CHANY_SELL0_Bit3              (0x8U << ADC_CHANY0_CHANY_SELL0_Pos) 
#define  ADC_CHANY0_CHANY_SELL1_Pos               (4)
#define  ADC_CHANY0_CHANY_SELL1_Msk               (0xFU << ADC_CHANY0_CHANY_SELL1_Pos)              /*!<1th Conversion Select for Any Channel sequence For Low Bits*/
#define  ADC_CHANY0_CHANY_SELL1                   ADC_CHANY0_CHANY_SELL1_Msk
#define  ADC_CHANY0_CHANY_SELL1_Bit0              (0x1U << ADC_CHANY0_CHANY_SELL1_Pos) 
#define  ADC_CHANY0_CHANY_SELL1_Bit1              (0x2U << ADC_CHANY0_CHANY_SELL1_Pos) 
#define  ADC_CHANY0_CHANY_SELL1_Bit2              (0x4U << ADC_CHANY0_CHANY_SELL1_Pos) 
#define  ADC_CHANY0_CHANY_SELL1_Bit3              (0x8U << ADC_CHANY0_CHANY_SELL1_Pos) 
#define  ADC_CHANY0_CHANY_SELL2_Pos               (8)
#define  ADC_CHANY0_CHANY_SELL2_Msk               (0xFU << ADC_CHANY0_CHANY_SELL2_Pos)              /*!<2th Conversion Select for Any Channel sequence For Low Bits*/
#define  ADC_CHANY0_CHANY_SELL2                   ADC_CHANY0_CHANY_SELL2_Msk
#define  ADC_CHANY0_CHANY_SELL2_Bit0              (0x1U << ADC_CHANY0_CHANY_SELL2_Pos) 
#define  ADC_CHANY0_CHANY_SELL2_Bit1              (0x2U << ADC_CHANY0_CHANY_SELL2_Pos) 
#define  ADC_CHANY0_CHANY_SELL2_Bit2              (0x4U << ADC_CHANY0_CHANY_SELL2_Pos) 
#define  ADC_CHANY0_CHANY_SELL2_Bit3              (0x8U << ADC_CHANY0_CHANY_SELL2_Pos) 
#define  ADC_CHANY0_CHANY_SELL3_Pos               (12)
#define  ADC_CHANY0_CHANY_SELL3_Msk               (0xFU << ADC_CHANY0_CHANY_SELL3_Pos)              /*!<3th Conversion Select for Any Channel sequence For Low Bits*/
#define  ADC_CHANY0_CHANY_SELL3                   ADC_CHANY0_CHANY_SELL3_Msk
#define  ADC_CHANY0_CHANY_SELL3_Bit0              (0x1U << ADC_CHANY0_CHANY_SELL3_Pos) 
#define  ADC_CHANY0_CHANY_SELL3_Bit1              (0x2U << ADC_CHANY0_CHANY_SELL3_Pos) 
#define  ADC_CHANY0_CHANY_SELL3_Bit2              (0x4U << ADC_CHANY0_CHANY_SELL3_Pos) 
#define  ADC_CHANY0_CHANY_SELL3_Bit3              (0x8U << ADC_CHANY0_CHANY_SELL3_Pos) 
#define  ADC_CHANY0_CHANY_SELL4_Pos               (16)
#define  ADC_CHANY0_CHANY_SELL4_Msk               (0xFU << ADC_CHANY0_CHANY_SELL4_Pos)              /*!<4th Conversion Select for Any Channel sequence For Low Bits*/
#define  ADC_CHANY0_CHANY_SELL4                   ADC_CHANY0_CHANY_SELL4_Msk
#define  ADC_CHANY0_CHANY_SELL4_Bit0              (0x1U << ADC_CHANY0_CHANY_SELL4_Pos) 
#define  ADC_CHANY0_CHANY_SELL4_Bit1              (0x2U << ADC_CHANY0_CHANY_SELL4_Pos) 
#define  ADC_CHANY0_CHANY_SELL4_Bit2              (0x4U << ADC_CHANY0_CHANY_SELL4_Pos) 
#define  ADC_CHANY0_CHANY_SELL4_Bit3              (0x8U << ADC_CHANY0_CHANY_SELL4_Pos) 
#define  ADC_CHANY0_CHANY_SELL5_Pos               (20)
#define  ADC_CHANY0_CHANY_SELL5_Msk               (0xFU << ADC_CHANY0_CHANY_SELL5_Pos)              /*!<5th Conversion Select for Any Channel sequence For Low Bits*/
#define  ADC_CHANY0_CHANY_SELL5                   ADC_CHANY0_CHANY_SELL5_Msk
#define  ADC_CHANY0_CHANY_SELL5_Bit0              (0x1U << ADC_CHANY0_CHANY_SELL5_Pos) 
#define  ADC_CHANY0_CHANY_SELL5_Bit1              (0x2U << ADC_CHANY0_CHANY_SELL5_Pos) 
#define  ADC_CHANY0_CHANY_SELL5_Bit2              (0x4U << ADC_CHANY0_CHANY_SELL5_Pos) 
#define  ADC_CHANY0_CHANY_SELL5_Bit3              (0x8U << ADC_CHANY0_CHANY_SELL5_Pos) 
#define  ADC_CHANY0_CHANY_SELL6_Pos               (24)
#define  ADC_CHANY0_CHANY_SELL6_Msk               (0xFU << ADC_CHANY0_CHANY_SELL6_Pos)              /*!<6th Conversion Select for Any Channel sequence For Low Bits*/
#define  ADC_CHANY0_CHANY_SELL6                   ADC_CHANY0_CHANY_SELL6_Msk
#define  ADC_CHANY0_CHANY_SELL6_Bit0              (0x1U << ADC_CHANY0_CHANY_SELL6_Pos) 
#define  ADC_CHANY0_CHANY_SELL6_Bit1              (0x2U << ADC_CHANY0_CHANY_SELL6_Pos) 
#define  ADC_CHANY0_CHANY_SELL6_Bit2              (0x4U << ADC_CHANY0_CHANY_SELL6_Pos) 
#define  ADC_CHANY0_CHANY_SELL6_Bit3              (0x8U << ADC_CHANY0_CHANY_SELL6_Pos) 
#define  ADC_CHANY0_CHANY_SELL7_Pos               (28)
#define  ADC_CHANY0_CHANY_SELL7_Msk               (0xFU << ADC_CHANY0_CHANY_SELL7_Pos)              /*!<7th Conversion Select for Any Channel sequence For Low Bits*/
#define  ADC_CHANY0_CHANY_SELL7                   ADC_CHANY0_CHANY_SELL7_Msk
#define  ADC_CHANY0_CHANY_SELL7_Bit0              (0x1U << ADC_CHANY0_CHANY_SELL7_Pos) 
#define  ADC_CHANY0_CHANY_SELL7_Bit1              (0x2U << ADC_CHANY0_CHANY_SELL7_Pos) 
#define  ADC_CHANY0_CHANY_SELL7_Bit2              (0x4U << ADC_CHANY0_CHANY_SELL7_Pos) 
#define  ADC_CHANY0_CHANY_SELL7_Bit3              (0x8U << ADC_CHANY0_CHANY_SELL7_Pos) 

/**
  * @brief ADC_CHANY1 Register Bit Definition
  */
#define  ADC_CHANY1_CHANY_SELL8_Pos               (0)
#define  ADC_CHANY1_CHANY_SELL8_Msk               (0xFU << ADC_CHANY1_CHANY_SELL8_Pos)              /*!<8th Conversion Select for Any Channel sequence*/
#define  ADC_CHANY1_CHANY_SELL8                   ADC_CHANY1_CHANY_SELL8_Msk
#define  ADC_CHANY1_CHANY_SELL8_Bit0              (0x1U << ADC_CHANY1_CHANY_SELL8_Pos) 
#define  ADC_CHANY1_CHANY_SELL8_Bit1              (0x2U << ADC_CHANY1_CHANY_SELL8_Pos) 
#define  ADC_CHANY1_CHANY_SELL8_Bit2              (0x4U << ADC_CHANY1_CHANY_SELL8_Pos) 
#define  ADC_CHANY1_CHANY_SELL8_Bit3              (0x8U << ADC_CHANY1_CHANY_SELL8_Pos) 
#define  ADC_CHANY1_CHANY_SELL9_Pos               (4)
#define  ADC_CHANY1_CHANY_SELL9_Msk               (0xFU << ADC_CHANY1_CHANY_SELL9_Pos)              /*!<9th Conversion Select for Any Channel sequence*/
#define  ADC_CHANY1_CHANY_SELL9                   ADC_CHANY1_CHANY_SELL9_Msk
#define  ADC_CHANY1_CHANY_SELL9_Bit0              (0x1U << ADC_CHANY1_CHANY_SELL9_Pos) 
#define  ADC_CHANY1_CHANY_SELL9_Bit1              (0x2U << ADC_CHANY1_CHANY_SELL9_Pos) 
#define  ADC_CHANY1_CHANY_SELL9_Bit2              (0x4U << ADC_CHANY1_CHANY_SELL9_Pos) 
#define  ADC_CHANY1_CHANY_SELL9_Bit3              (0x8U << ADC_CHANY1_CHANY_SELL9_Pos) 
#define  ADC_CHANY1_CHANY_SELL10_Pos              (8)
#define  ADC_CHANY1_CHANY_SELL10_Msk              (0xFU << ADC_CHANY1_CHANY_SELL10_Pos)             /*!<10th Conversion Select for Any Channel sequence*/
#define  ADC_CHANY1_CHANY_SELL10                  ADC_CHANY1_CHANY_SELL10_Msk
#define  ADC_CHANY1_CHANY_SELL10_Bit0             (0x1U << ADC_CHANY1_CHANY_SELL10_Pos) 
#define  ADC_CHANY1_CHANY_SELL10_Bit1             (0x2U << ADC_CHANY1_CHANY_SELL10_Pos) 
#define  ADC_CHANY1_CHANY_SELL10_Bit2             (0x4U << ADC_CHANY1_CHANY_SELL10_Pos) 
#define  ADC_CHANY1_CHANY_SELL10_Bit3             (0x8U << ADC_CHANY1_CHANY_SELL10_Pos) 
#define  ADC_CHANY1_CHANY_SELL11_Pos              (12)
#define  ADC_CHANY1_CHANY_SELL11_Msk              (0xFU << ADC_CHANY1_CHANY_SELL11_Pos)             /*!<11th Conversion Select for Any Channel sequence*/
#define  ADC_CHANY1_CHANY_SELL11                  ADC_CHANY1_CHANY_SELL11_Msk
#define  ADC_CHANY1_CHANY_SELL11_Bit0             (0x1U << ADC_CHANY1_CHANY_SELL11_Pos) 
#define  ADC_CHANY1_CHANY_SELL11_Bit1             (0x2U << ADC_CHANY1_CHANY_SELL11_Pos) 
#define  ADC_CHANY1_CHANY_SELL11_Bit2             (0x4U << ADC_CHANY1_CHANY_SELL11_Pos) 
#define  ADC_CHANY1_CHANY_SELL11_Bit3             (0x8U << ADC_CHANY1_CHANY_SELL11_Pos) 
#define  ADC_CHANY1_CHANY_SELL12_Pos              (16)
#define  ADC_CHANY1_CHANY_SELL12_Msk              (0xFU << ADC_CHANY1_CHANY_SELL12_Pos)             /*!<12th Conversion Select for Any Channel sequence*/
#define  ADC_CHANY1_CHANY_SELL12                  ADC_CHANY1_CHANY_SELL12_Msk
#define  ADC_CHANY1_CHANY_SELL12_Bit0             (0x1U << ADC_CHANY1_CHANY_SELL12_Pos) 
#define  ADC_CHANY1_CHANY_SELL12_Bit1             (0x2U << ADC_CHANY1_CHANY_SELL12_Pos) 
#define  ADC_CHANY1_CHANY_SELL12_Bit2             (0x4U << ADC_CHANY1_CHANY_SELL12_Pos) 
#define  ADC_CHANY1_CHANY_SELL12_Bit3             (0x8U << ADC_CHANY1_CHANY_SELL12_Pos) 
#define  ADC_CHANY1_CHANY_SELL13_Pos              (20)
#define  ADC_CHANY1_CHANY_SELL13_Msk              (0xFU << ADC_CHANY1_CHANY_SELL13_Pos)             /*!<13th Conversion Select for Any Channel sequence*/
#define  ADC_CHANY1_CHANY_SELL13                  ADC_CHANY1_CHANY_SELL13_Msk
#define  ADC_CHANY1_CHANY_SELL13_Bit0             (0x1U << ADC_CHANY1_CHANY_SELL13_Pos) 
#define  ADC_CHANY1_CHANY_SELL13_Bit1             (0x2U << ADC_CHANY1_CHANY_SELL13_Pos) 
#define  ADC_CHANY1_CHANY_SELL13_Bit2             (0x4U << ADC_CHANY1_CHANY_SELL13_Pos) 
#define  ADC_CHANY1_CHANY_SELL13_Bit3             (0x8U << ADC_CHANY1_CHANY_SELL13_Pos) 
#define  ADC_CHANY1_CHANY_SELL14_Pos              (24)
#define  ADC_CHANY1_CHANY_SELL14_Msk              (0xFU << ADC_CHANY1_CHANY_SELL14_Pos)             /*!<14th Conversion Select for Any Channel sequence For Low Bits*/
#define  ADC_CHANY1_CHANY_SELL14                  ADC_CHANY1_CHANY_SELL14_Msk
#define  ADC_CHANY1_CHANY_SELL14_Bit0             (0x1U << ADC_CHANY1_CHANY_SELL14_Pos) 
#define  ADC_CHANY1_CHANY_SELL14_Bit1             (0x2U << ADC_CHANY1_CHANY_SELL14_Pos) 
#define  ADC_CHANY1_CHANY_SELL14_Bit2             (0x4U << ADC_CHANY1_CHANY_SELL14_Pos) 
#define  ADC_CHANY1_CHANY_SELL14_Bit3             (0x8U << ADC_CHANY1_CHANY_SELL14_Pos) 
#define  ADC_CHANY1_CHANY_SELL15_Pos              (28)
#define  ADC_CHANY1_CHANY_SELL15_Msk              (0xFU << ADC_CHANY1_CHANY_SELL15_Pos)             /*!<15th Conversion Select for Any Channel sequence For Low Bits*/
#define  ADC_CHANY1_CHANY_SELL15                  ADC_CHANY1_CHANY_SELL15_Msk
#define  ADC_CHANY1_CHANY_SELL15_Bit0             (0x1U << ADC_CHANY1_CHANY_SELL15_Pos) 
#define  ADC_CHANY1_CHANY_SELL15_Bit1             (0x2U << ADC_CHANY1_CHANY_SELL15_Pos) 
#define  ADC_CHANY1_CHANY_SELL15_Bit2             (0x4U << ADC_CHANY1_CHANY_SELL15_Pos) 
#define  ADC_CHANY1_CHANY_SELL15_Bit3             (0x8U << ADC_CHANY1_CHANY_SELL15_Pos) 

