SkydiverMCU/mcu-iap-demo/STAR-MC1/MM32F5370/USB_Custom_HID/MM32F5370_HID_Bootloader/Device/MM32F5370/Include/reg_adc.h
/**
  * @brief ADC_ANY_CFG Register Bit Definition
  */
#define  ADC_ANY_CFG_CHANY_NUM_Pos                (0)
#define  ADC_ANY_CFG_CHANY_NUM_Msk                (0xFU << ADC_ANY_CFG_CHANY_NUM_Pos)               /*!<Number of Any Channel Mode*/
#define  ADC_ANY_CFG_CHANY_NUM                    ADC_ANY_CFG_CHANY_NUM_Msk
#define  ADC_ANY_CFG_CHANY_NUM_Bit0               (0x1U << ADC_ANY_CFG_CHANY_NUM_Pos) 
#define  ADC_ANY_CFG_CHANY_NUM_Bit1               (0x2U << ADC_ANY_CFG_CHANY_NUM_Pos) 
#define  ADC_ANY_CFG_CHANY_NUM_Bit2               (0x4U << ADC_ANY_CFG_CHANY_NUM_Pos) 
#define  ADC_ANY_CFG_CHANY_NUM_Bit3               (0x8U << ADC_ANY_CFG_CHANY_NUM_Pos) 
#define  ADC_ANY_CFG_CHANY_SELH0_Pos              (8)
#define  ADC_ANY_CFG_CHANY_SELH0_Msk              (0x1U << ADC_ANY_CFG_CHANY_SELH0_Pos)             /*!<0th Conversion Select for Any Channel sequence For High Bits*/
#define  ADC_ANY_CFG_CHANY_SELH0                  ADC_ANY_CFG_CHANY_SELH0_Msk
#define  ADC_ANY_CFG_CHANY_SELH1_Pos              (9)
#define  ADC_ANY_CFG_CHANY_SELH1_Msk              (0x1U << ADC_ANY_CFG_CHANY_SELH1_Pos)             /*!<1th Conversion Select for Any Channel sequence For High Bits*/
#define  ADC_ANY_CFG_CHANY_SELH1                  ADC_ANY_CFG_CHANY_SELH1_Msk
#define  ADC_ANY_CFG_CHANY_SELH2_Pos              (10)
#define  ADC_ANY_CFG_CHANY_SELH2_Msk              (0x1U << ADC_ANY_CFG_CHANY_SELH2_Pos)             /*!<2th Conversion Select for Any Channel sequence For High Bits*/
#define  ADC_ANY_CFG_CHANY_SELH2                  ADC_ANY_CFG_CHANY_SELH2_Msk
#define  ADC_ANY_CFG_CHANY_SELH3_Pos              (11)
#define  ADC_ANY_CFG_CHANY_SELH3_Msk              (0x1U << ADC_ANY_CFG_CHANY_SELH3_Pos)             /*!<3th Conversion Select for Any Channel sequence For High Bits*/
#define  ADC_ANY_CFG_CHANY_SELH3                  ADC_ANY_CFG_CHANY_SELH3_Msk
#define  ADC_ANY_CFG_CHANY_SELH4_Pos              (12)
#define  ADC_ANY_CFG_CHANY_SELH4_Msk              (0x1U << ADC_ANY_CFG_CHANY_SELH4_Pos)             /*!<4th Conversion Select for Any Channel sequence For High Bits*/
#define  ADC_ANY_CFG_CHANY_SELH4                  ADC_ANY_CFG_CHANY_SELH4_Msk
#define  ADC_ANY_CFG_CHANY_SELH5_Pos              (13)
#define  ADC_ANY_CFG_CHANY_SELH5_Msk              (0x1U << ADC_ANY_CFG_CHANY_SELH5_Pos)             /*!<5th Conversion Select for Any Channel sequence For High Bits*/
#define  ADC_ANY_CFG_CHANY_SELH5                  ADC_ANY_CFG_CHANY_SELH5_Msk
#define  ADC_ANY_CFG_CHANY_SELH6_Pos              (14)
#define  ADC_ANY_CFG_CHANY_SELH6_Msk              (0x1U << ADC_ANY_CFG_CHANY_SELH6_Pos)             /*!<6th Conversion Select for Any Channel sequence For High Bits*/
#define  ADC_ANY_CFG_CHANY_SELH6                  ADC_ANY_CFG_CHANY_SELH6_Msk
#define  ADC_ANY_CFG_CHANY_SELH7_Pos              (15)
#define  ADC_ANY_CFG_CHANY_SELH7_Msk              (0x1U << ADC_ANY_CFG_CHANY_SELH7_Pos)             /*!<7th Conversion Select for Any Channel sequence For High Bits*/
#define  ADC_ANY_CFG_CHANY_SELH7                  ADC_ANY_CFG_CHANY_SELH7_Msk
#define  ADC_ANY_CFG_CHANY_SELH8_Pos              (16)
#define  ADC_ANY_CFG_CHANY_SELH8_Msk              (0x1U << ADC_ANY_CFG_CHANY_SELH8_Pos)             /*!<8th Conversion Select for Any Channel sequence For High Bits*/
#define  ADC_ANY_CFG_CHANY_SELH8                  ADC_ANY_CFG_CHANY_SELH8_Msk
#define  ADC_ANY_CFG_CHANY_SELH9_Pos              (17)
#define  ADC_ANY_CFG_CHANY_SELH9_Msk              (0x1U << ADC_ANY_CFG_CHANY_SELH9_Pos)             /*!<9th Conversion Select for Any Channel sequence For High Bits*/
#define  ADC_ANY_CFG_CHANY_SELH9                  ADC_ANY_CFG_CHANY_SELH9_Msk
#define  ADC_ANY_CFG_CHANY_SELH10_Pos             (18)
#define  ADC_ANY_CFG_CHANY_SELH10_Msk             (0x1U << ADC_ANY_CFG_CHANY_SELH10_Pos)            /*!<10th Conversion Select for Any Channel sequence For High Bits*/
#define  ADC_ANY_CFG_CHANY_SELH10                 ADC_ANY_CFG_CHANY_SELH10_Msk
#define  ADC_ANY_CFG_CHANY_SELH11_Pos             (19)
#define  ADC_ANY_CFG_CHANY_SELH11_Msk             (0x1U << ADC_ANY_CFG_CHANY_SELH11_Pos)            /*!<11th Conversion Select for Any Channel sequence For High Bits*/
#define  ADC_ANY_CFG_CHANY_SELH11                 ADC_ANY_CFG_CHANY_SELH11_Msk
#define  ADC_ANY_CFG_CHANY_SELH12_Pos             (20)
#define  ADC_ANY_CFG_CHANY_SELH12_Msk             (0x1U << ADC_ANY_CFG_CHANY_SELH12_Pos)            /*!<12th Conversion Select for Any Channel sequence For High Bits*/
#define  ADC_ANY_CFG_CHANY_SELH12                 ADC_ANY_CFG_CHANY_SELH12_Msk
#define  ADC_ANY_CFG_CHANY_SELH13_Pos             (21)
#define  ADC_ANY_CFG_CHANY_SELH13_Msk             (0x1U << ADC_ANY_CFG_CHANY_SELH13_Pos)            /*!<13th Conversion Select for Any Channel sequence For High Bits*/
#define  ADC_ANY_CFG_CHANY_SELH13                 ADC_ANY_CFG_CHANY_SELH13_Msk
#define  ADC_ANY_CFG_CHANY_SELH14_Pos             (22)
#define  ADC_ANY_CFG_CHANY_SELH14_Msk             (0x1U << ADC_ANY_CFG_CHANY_SELH14_Pos)            /*!<14th Conversion Select for Any Channel sequence For High Bits*/
#define  ADC_ANY_CFG_CHANY_SELH14                 ADC_ANY_CFG_CHANY_SELH14_Msk
#define  ADC_ANY_CFG_CHANY_SELH15_Pos             (23)
#define  ADC_ANY_CFG_CHANY_SELH15_Msk             (0x1U << ADC_ANY_CFG_CHANY_SELH15_Pos)            /*!<15th Conversion Select for Any Channel sequence For High Bits*/
#define  ADC_ANY_CFG_CHANY_SELH15                 ADC_ANY_CFG_CHANY_SELH15_Msk

/**
  * @brief ADC_ANY_CR Register Bit Definition
  */
#define  ADC_ANY_CR_CHANY_MDEN_Pos                (0)
#define  ADC_ANY_CR_CHANY_MDEN_Msk                (0x1U << ADC_ANY_CR_CHANY_MDEN_Pos)               /*!<Any Channel Mode Enable*/
#define  ADC_ANY_CR_CHANY_MDEN                    ADC_ANY_CR_CHANY_MDEN_Msk
#define  ADC_ANY_CR_JCEN_Pos                      (1)
#define  ADC_ANY_CR_JCEN_Msk                      (0x1U << ADC_ANY_CR_JCEN_Pos)                     /*!<Conversion Enable for Injected Channels*/
#define  ADC_ANY_CR_JCEN                          ADC_ANY_CR_JCEN_Msk
#define  ADC_ANY_CR_JEOSMPIE_Pos                  (2)
#define  ADC_ANY_CR_JEOSMPIE_Msk                  (0x1U << ADC_ANY_CR_JEOSMPIE_Pos)                 /*!<Interrupt Enable for JEOSAMP*/
#define  ADC_ANY_CR_JEOSMPIE                      ADC_ANY_CR_JEOSMPIE_Msk
#define  ADC_ANY_CR_JEOCIE_Pos                    (3)
#define  ADC_ANY_CR_JEOCIE_Msk                    (0x1U << ADC_ANY_CR_JEOCIE_Pos)                   /*!<Interrupt Enable for JEOC*/
#define  ADC_ANY_CR_JEOCIE                        ADC_ANY_CR_JEOCIE_Msk
#define  ADC_ANY_CR_JEOSIE_Pos                    (4)
#define  ADC_ANY_CR_JEOSIE_Msk                    (0x1U << ADC_ANY_CR_JEOSIE_Pos)                   /*!<Interrupt Enable for JEOS*/
#define  ADC_ANY_CR_JEOSIE                        ADC_ANY_CR_JEOSIE_Msk
#define  ADC_ANY_CR_JAUTO_Pos                     (5)
#define  ADC_ANY_CR_JAUTO_Msk                     (0x1U << ADC_ANY_CR_JAUTO_Pos)                    /*!<Automatic Injected Conversion*/
#define  ADC_ANY_CR_JAUTO                         ADC_ANY_CR_JAUTO_Msk
#define  ADC_ANY_CR_JADST_Pos                     (6)
#define  ADC_ANY_CR_JADST_Msk                     (0x1U << ADC_ANY_CR_JADST_Pos)                    /*!<ADC Start for Injected Channels: enable JCEN first*/
#define  ADC_ANY_CR_JADST                         ADC_ANY_CR_JADST_Msk
#define  ADC_ANY_CR_JTRGEN_Pos                    (7)
#define  ADC_ANY_CR_JTRGEN_Msk                    (0x1U << ADC_ANY_CR_JTRGEN_Pos)                   /*!<External Hardware Trigger Enable For Injected Channels*/
#define  ADC_ANY_CR_JTRGEN                        ADC_ANY_CR_JTRGEN_Msk
#define  ADC_ANY_CR_JTRGSHIFT_Pos                 (13)
#define  ADC_ANY_CR_JTRGSHIFT_Msk                 (0x7U << ADC_ANY_CR_JTRGSHIFT_Pos)                /*!<External Trigger Shift Sample for Injected Channels After a trigger signal is generated, the sampling starts after a delay of N PCLK2 clock cycles. In case of trigger scan, the sampling in the rest channels starts immediately after the last sampling is complete.*/
#define  ADC_ANY_CR_JTRGSHIFT                     ADC_ANY_CR_JTRGSHIFT_Msk
#define  ADC_ANY_CR_JTRGSHIFT_Bit0                (0x1U << ADC_ANY_CR_JTRGSHIFT_Pos) 
#define  ADC_ANY_CR_JTRGSHIFT_Bit1                (0x2U << ADC_ANY_CR_JTRGSHIFT_Pos) 
#define  ADC_ANY_CR_JTRGSHIFT_Bit2                (0x4U << ADC_ANY_CR_JTRGSHIFT_Pos) 
#define  ADC_ANY_CR_JTRG_EDGE_Pos                 (16)
#define  ADC_ANY_CR_JTRG_EDGE_Msk                 (0x3U << ADC_ANY_CR_JTRG_EDGE_Pos)                /*!<External Trigger sources Edge Selection for Injected Channels*/
#define  ADC_ANY_CR_JTRG_EDGE                     ADC_ANY_CR_JTRG_EDGE_Msk
#define  ADC_ANY_CR_JTRG_EDGE_Bit0                (0x1U << ADC_ANY_CR_JTRG_EDGE_Pos) 
#define  ADC_ANY_CR_JTRG_EDGE_Bit1                (0x2U << ADC_ANY_CR_JTRG_EDGE_Pos) 
#define  ADC_ANY_CR_ADCAL_Pos                     (20)
#define  ADC_ANY_CR_ADCAL_Msk                     (0x1U << ADC_ANY_CR_ADCAL_Pos)                    /*!<A/D Calibration Start*/
#define  ADC_ANY_CR_ADCAL                         ADC_ANY_CR_ADCAL_Msk
#define  ADC_ANY_CR_EOCALIE_Pos                   (21)
#define  ADC_ANY_CR_EOCALIE_Msk                   (0x1U << ADC_ANY_CR_EOCALIE_Pos)                  /*!<End of self-calibration interrupt enable*/
#define  ADC_ANY_CR_EOCALIE                       ADC_ANY_CR_EOCALIE_Msk

/**
  * @brief ADC_ADCFG2 Register Bit Definition
  */
#define  ADC_ADCFG2_CORREN_Pos                    (0)
#define  ADC_ADCFG2_CORREN_Msk                    (0x1U << ADC_ADCFG2_CORREN_Pos)                   /*!<Conversion correction enable*/
#define  ADC_ADCFG2_CORREN                        ADC_ADCFG2_CORREN_Msk
#define  ADC_ADCFG2_ADCCR_Pos                     (1)
#define  ADC_ADCFG2_ADCCR_Msk                     (0x1U << ADC_ADCFG2_ADCCR_Pos)                    /*!<ADC low-power control (ADC Control)*/
#define  ADC_ADCFG2_ADCCR                         ADC_ADCFG2_ADCCR_Msk
#define  ADC_ADCFG2_ADCSREF_Pos                   (2)
#define  ADC_ADCFG2_ADCSREF_Msk                   (0x1U << ADC_ADCFG2_ADCSREF_Pos)                  /*!<Reference Voltage Selection (ADC Select Reference Voltage)*/
#define  ADC_ADCFG2_ADCSREF                       ADC_ADCFG2_ADCSREF_Msk
#define  ADC_ADCFG2_CORRVSEL_Pos                  (3)
#define  ADC_ADCFG2_CORRVSEL_Msk                  (0x1U << ADC_ADCFG2_CORRVSEL_Pos)                 /*!<correct vref select*/
#define  ADC_ADCFG2_CORRVSEL                      ADC_ADCFG2_CORRVSEL_Msk
#define  ADC_ADCFG2_DC_Pos                        (4)
#define  ADC_ADCFG2_DC_Msk                        (0x1FU << ADC_ADCFG2_DC_Pos)                      /*!<Differential configuration selection (Differential Conversion)*/
#define  ADC_ADCFG2_DC                            ADC_ADCFG2_DC_Msk
#define  ADC_ADCFG2_DC_Bit0                       (0x01U << ADC_ADCFG2_DC_Pos) 
#define  ADC_ADCFG2_DC_Bit1                       (0x02U << ADC_ADCFG2_DC_Pos) 
#define  ADC_ADCFG2_DC_Bit2                       (0x04U << ADC_ADCFG2_DC_Pos) 
#define  ADC_ADCFG2_DC_Bit3                       (0x08U << ADC_ADCFG2_DC_Pos) 
#define  ADC_ADCFG2_DC_Bit4                       (0x10U << ADC_ADCFG2_DC_Pos) 
#define  ADC_ADCFG2_PSDC_Pos                      (10)
#define  ADC_ADCFG2_PSDC_Msk                      (0x1FU << ADC_ADCFG2_PSDC_Pos)                    /*!<Pseudo Differential Configuration Selection (Pseudo Differential Conversion)*/
#define  ADC_ADCFG2_PSDC                          ADC_ADCFG2_PSDC_Msk
#define  ADC_ADCFG2_PSDC_Bit0                     (0x01U << ADC_ADCFG2_PSDC_Pos) 
#define  ADC_ADCFG2_PSDC_Bit1                     (0x02U << ADC_ADCFG2_PSDC_Pos) 
#define  ADC_ADCFG2_PSDC_Bit2                     (0x04U << ADC_ADCFG2_PSDC_Pos) 
#define  ADC_ADCFG2_PSDC_Bit3                     (0x08U << ADC_ADCFG2_PSDC_Pos) 
#define  ADC_ADCFG2_PSDC_Bit4                     (0x10U << ADC_ADCFG2_PSDC_Pos) 
#define  ADC_ADCFG2_ROVSE_Pos                     (16)
#define  ADC_ADCFG2_ROVSE_Msk                     (0x1U << ADC_ADCFG2_ROVSE_Pos)                    /*!<Regular Oversampler Enable*/
#define  ADC_ADCFG2_ROVSE                         ADC_ADCFG2_ROVSE_Msk
#define  ADC_ADCFG2_JOVSE_Pos                     (17)
#define  ADC_ADCFG2_JOVSE_Msk                     (0x1U << ADC_ADCFG2_JOVSE_Pos)                    /*!<Injected Oversampler Enable*/
#define  ADC_ADCFG2_JOVSE                         ADC_ADCFG2_JOVSE_Msk
#define  ADC_ADCFG2_OVSR_Pos                      (18)
#define  ADC_ADCFG2_OVSR_Msk                      (0x7U << ADC_ADCFG2_OVSR_Pos)                     /*!<Oversampling Ratio*/
#define  ADC_ADCFG2_OVSR                          ADC_ADCFG2_OVSR_Msk
#define  ADC_ADCFG2_OVSR_Bit0                     (0x1U << ADC_ADCFG2_OVSR_Pos) 
#define  ADC_ADCFG2_OVSR_Bit1                     (0x2U << ADC_ADCFG2_OVSR_Pos) 
#define  ADC_ADCFG2_OVSR_Bit2                     (0x4U << ADC_ADCFG2_OVSR_Pos) 
#define  ADC_ADCFG2_OVSS_Pos                      (21)
#define  ADC_ADCFG2_OVSS_Msk                      (0xFU << ADC_ADCFG2_OVSS_Pos)                     /*!<Oversampling Shift Bits*/
#define  ADC_ADCFG2_OVSS                          ADC_ADCFG2_OVSS_Msk
#define  ADC_ADCFG2_OVSS_Bit0                     (0x1U << ADC_ADCFG2_OVSS_Pos) 
#define  ADC_ADCFG2_OVSS_Bit1                     (0x2U << ADC_ADCFG2_OVSS_Pos) 
#define  ADC_ADCFG2_OVSS_Bit2                     (0x4U << ADC_ADCFG2_OVSS_Pos) 
#define  ADC_ADCFG2_OVSS_Bit3                     (0x8U << ADC_ADCFG2_OVSS_Pos) 
#define  ADC_ADCFG2_TROVS_Pos                     (25)
#define  ADC_ADCFG2_TROVS_Msk                     (0x1U << ADC_ADCFG2_TROVS_Pos)                    /*!<Trigger Oversampling Select*/
#define  ADC_ADCFG2_TROVS                         ADC_ADCFG2_TROVS_Msk

/**
  * @brief ADC_SMPR1 Register Bit Definition
  */
#define  ADC_SMPR1_SAMP0_Pos                      (0)
#define  ADC_SMPR1_SAMP0_Msk                      (0xFU << ADC_SMPR1_SAMP0_Pos)                     /*!<Channel 0 Sample Time Selection*/
#define  ADC_SMPR1_SAMP0                          ADC_SMPR1_SAMP0_Msk
#define  ADC_SMPR1_SAMP0_Bit0                     (0x1U << ADC_SMPR1_SAMP0_Pos) 
#define  ADC_SMPR1_SAMP0_Bit1                     (0x2U << ADC_SMPR1_SAMP0_Pos) 
#define  ADC_SMPR1_SAMP0_Bit2                     (0x4U << ADC_SMPR1_SAMP0_Pos) 
#define  ADC_SMPR1_SAMP0_Bit3                     (0x8U << ADC_SMPR1_SAMP0_Pos) 
#define  ADC_SMPR1_SAMP1_Pos                      (4)
#define  ADC_SMPR1_SAMP1_Msk                      (0xFU << ADC_SMPR1_SAMP1_Pos)                     /*!<Channel 1 Sample Time Selection*/
#define  ADC_SMPR1_SAMP1                          ADC_SMPR1_SAMP1_Msk
#define  ADC_SMPR1_SAMP1_Bit0                     (0x1U << ADC_SMPR1_SAMP1_Pos) 
#define  ADC_SMPR1_SAMP1_Bit1                     (0x2U << ADC_SMPR1_SAMP1_Pos) 
#define  ADC_SMPR1_SAMP1_Bit2                     (0x4U << ADC_SMPR1_SAMP1_Pos) 
#define  ADC_SMPR1_SAMP1_Bit3                     (0x8U << ADC_SMPR1_SAMP1_Pos) 
#define  ADC_SMPR1_SAMP2_Pos                      (8)
#define  ADC_SMPR1_SAMP2_Msk                      (0xFU << ADC_SMPR1_SAMP2_Pos)                     /*!<Channel 2 Sample Time Selection*/
#define  ADC_SMPR1_SAMP2                          ADC_SMPR1_SAMP2_Msk
#define  ADC_SMPR1_SAMP2_Bit0                     (0x1U << ADC_SMPR1_SAMP2_Pos) 
#define  ADC_SMPR1_SAMP2_Bit1                     (0x2U << ADC_SMPR1_SAMP2_Pos) 
#define  ADC_SMPR1_SAMP2_Bit2                     (0x4U << ADC_SMPR1_SAMP2_Pos) 
#define  ADC_SMPR1_SAMP2_Bit3                     (0x8U << ADC_SMPR1_SAMP2_Pos) 
#define  ADC_SMPR1_SAMP3_Pos                      (12)
#define  ADC_SMPR1_SAMP3_Msk                      (0xFU << ADC_SMPR1_SAMP3_Pos)                     /*!<Channel 3 Sample Time Selection*/
#define  ADC_SMPR1_SAMP3                          ADC_SMPR1_SAMP3_Msk
#define  ADC_SMPR1_SAMP3_Bit0                     (0x1U << ADC_SMPR1_SAMP3_Pos) 
#define  ADC_SMPR1_SAMP3_Bit1                     (0x2U << ADC_SMPR1_SAMP3_Pos) 
#define  ADC_SMPR1_SAMP3_Bit2                     (0x4U << ADC_SMPR1_SAMP3_Pos) 
#define  ADC_SMPR1_SAMP3_Bit3                     (0x8U << ADC_SMPR1_SAMP3_Pos) 
#define  ADC_SMPR1_SAMP4_Pos                      (16)
#define  ADC_SMPR1_SAMP4_Msk                      (0xFU << ADC_SMPR1_SAMP4_Pos)                     /*!<Channel 4 Sample Time Selection*/
#define  ADC_SMPR1_SAMP4                          ADC_SMPR1_SAMP4_Msk
#define  ADC_SMPR1_SAMP4_Bit0                     (0x1U << ADC_SMPR1_SAMP4_Pos) 
#define  ADC_SMPR1_SAMP4_Bit1                     (0x2U << ADC_SMPR1_SAMP4_Pos) 
#define  ADC_SMPR1_SAMP4_Bit2                     (0x4U << ADC_SMPR1_SAMP4_Pos) 
#define  ADC_SMPR1_SAMP4_Bit3                     (0x8U << ADC_SMPR1_SAMP4_Pos) 
#define  ADC_SMPR1_SAMP5_Pos                      (20)
#define  ADC_SMPR1_SAMP5_Msk                      (0xFU << ADC_SMPR1_SAMP5_Pos)                     /*!<Channel 5 Sample Time Selection*/
#define  ADC_SMPR1_SAMP5                          ADC_SMPR1_SAMP5_Msk
#define  ADC_SMPR1_SAMP5_Bit0                     (0x1U << ADC_SMPR1_SAMP5_Pos) 
#define  ADC_SMPR1_SAMP5_Bit1                     (0x2U << ADC_SMPR1_SAMP5_Pos) 
#define  ADC_SMPR1_SAMP5_Bit2                     (0x4U << ADC_SMPR1_SAMP5_Pos) 
#define  ADC_SMPR1_SAMP5_Bit3                     (0x8U << ADC_SMPR1_SAMP5_Pos) 
#define  ADC_SMPR1_SAMP6_Pos                      (24)
#define  ADC_SMPR1_SAMP6_Msk                      (0xFU << ADC_SMPR1_SAMP6_Pos)                     /*!<Channel 6 Sample Time Selection*/
#define  ADC_SMPR1_SAMP6                          ADC_SMPR1_SAMP6_Msk
#define  ADC_SMPR1_SAMP6_Bit0                     (0x1U << ADC_SMPR1_SAMP6_Pos) 
#define  ADC_SMPR1_SAMP6_Bit1                     (0x2U << ADC_SMPR1_SAMP6_Pos) 
#define  ADC_SMPR1_SAMP6_Bit2                     (0x4U << ADC_SMPR1_SAMP6_Pos) 
#define  ADC_SMPR1_SAMP6_Bit3                     (0x8U << ADC_SMPR1_SAMP6_Pos) 
#define  ADC_SMPR1_SAMP7_Pos                      (28)
#define  ADC_SMPR1_SAMP7_Msk                      (0xFU << ADC_SMPR1_SAMP7_Pos)                     /*!<Channel 7 Sample Time Selection These bits are used to independently select the sample time of each channel. In a sample cycle, the channel selection bit should remain unchanged*/
#define  ADC_SMPR1_SAMP7                          ADC_SMPR1_SAMP7_Msk
#define  ADC_SMPR1_SAMP7_Bit0                     (0x1U << ADC_SMPR1_SAMP7_Pos) 
#define  ADC_SMPR1_SAMP7_Bit1                     (0x2U << ADC_SMPR1_SAMP7_Pos) 
#define  ADC_SMPR1_SAMP7_Bit2                     (0x4U << ADC_SMPR1_SAMP7_Pos) 
#define  ADC_SMPR1_SAMP7_Bit3                     (0x8U << ADC_SMPR1_SAMP7_Pos) 

/**
  * @brief ADC_SMPR2 Register Bit Definition
  */
#define  ADC_SMPR2_SAMP8_Pos                      (0)
#define  ADC_SMPR2_SAMP8_Msk                      (0xFU << ADC_SMPR2_SAMP8_Pos)                     /*!<Channel 8 Sample Time Selection*/
#define  ADC_SMPR2_SAMP8                          ADC_SMPR2_SAMP8_Msk
#define  ADC_SMPR2_SAMP8_Bit0                     (0x1U << ADC_SMPR2_SAMP8_Pos) 
#define  ADC_SMPR2_SAMP8_Bit1                     (0x2U << ADC_SMPR2_SAMP8_Pos) 
#define  ADC_SMPR2_SAMP8_Bit2                     (0x4U << ADC_SMPR2_SAMP8_Pos) 
#define  ADC_SMPR2_SAMP8_Bit3                     (0x8U << ADC_SMPR2_SAMP8_Pos) 
#define  ADC_SMPR2_SAMP9_Pos                      (4)
#define  ADC_SMPR2_SAMP9_Msk                      (0xFU << ADC_SMPR2_SAMP9_Pos)                     /*!<Channel 9 Sample Time Selection*/
#define  ADC_SMPR2_SAMP9                          ADC_SMPR2_SAMP9_Msk
#define  ADC_SMPR2_SAMP9_Bit0                     (0x1U << ADC_SMPR2_SAMP9_Pos) 
#define  ADC_SMPR2_SAMP9_Bit1                     (0x2U << ADC_SMPR2_SAMP9_Pos) 
#define  ADC_SMPR2_SAMP9_Bit2                     (0x4U << ADC_SMPR2_SAMP9_Pos) 
#define  ADC_SMPR2_SAMP9_Bit3                     (0x8U << ADC_SMPR2_SAMP9_Pos) 
#define  ADC_SMPR2_SAMP10_Pos                     (8)
#define  ADC_SMPR2_SAMP10_Msk                     (0xFU << ADC_SMPR2_SAMP10_Pos)                    /*!<Channel 10 Sample Time Selection*/
#define  ADC_SMPR2_SAMP10                         ADC_SMPR2_SAMP10_Msk
#define  ADC_SMPR2_SAMP10_Bit0                    (0x1U << ADC_SMPR2_SAMP10_Pos) 
#define  ADC_SMPR2_SAMP10_Bit1                    (0x2U << ADC_SMPR2_SAMP10_Pos) 
#define  ADC_SMPR2_SAMP10_Bit2                    (0x4U << ADC_SMPR2_SAMP10_Pos) 
#define  ADC_SMPR2_SAMP10_Bit3                    (0x8U << ADC_SMPR2_SAMP10_Pos) 
#define  ADC_SMPR2_SAMP11_Pos                     (12)
#define  ADC_SMPR2_SAMP11_Msk                     (0xFU << ADC_SMPR2_SAMP11_Pos)                    /*!<Channel 11 Sample Time Selection*/
#define  ADC_SMPR2_SAMP11                         ADC_SMPR2_SAMP11_Msk
#define  ADC_SMPR2_SAMP11_Bit0                    (0x1U << ADC_SMPR2_SAMP11_Pos) 
#define  ADC_SMPR2_SAMP11_Bit1                    (0x2U << ADC_SMPR2_SAMP11_Pos) 
#define  ADC_SMPR2_SAMP11_Bit2                    (0x4U << ADC_SMPR2_SAMP11_Pos) 
#define  ADC_SMPR2_SAMP11_Bit3                    (0x8U << ADC_SMPR2_SAMP11_Pos) 
#define  ADC_SMPR2_SAMP12_Pos                     (16)
#define  ADC_SMPR2_SAMP12_Msk                     (0xFU << ADC_SMPR2_SAMP12_Pos)                    /*!<Channel 12 Sample Time Selection*/
#define  ADC_SMPR2_SAMP12                         ADC_SMPR2_SAMP12_Msk
#define  ADC_SMPR2_SAMP12_Bit0                    (0x1U << ADC_SMPR2_SAMP12_Pos) 
#define  ADC_SMPR2_SAMP12_Bit1                    (0x2U << ADC_SMPR2_SAMP12_Pos) 
#define  ADC_SMPR2_SAMP12_Bit2                    (0x4U << ADC_SMPR2_SAMP12_Pos) 
#define  ADC_SMPR2_SAMP12_Bit3                    (0x8U << ADC_SMPR2_SAMP12_Pos) 
#define  ADC_SMPR2_SAMP13_Pos                     (20)
#define  ADC_SMPR2_SAMP13_Msk                     (0xFU << ADC_SMPR2_SAMP13_Pos)                    /*!<Channel 13 Sample Time Selection*/
#define  ADC_SMPR2_SAMP13                         ADC_SMPR2_SAMP13_Msk
#define  ADC_SMPR2_SAMP13_Bit0                    (0x1U << ADC_SMPR2_SAMP13_Pos) 
#define  ADC_SMPR2_SAMP13_Bit1                    (0x2U << ADC_SMPR2_SAMP13_Pos) 
#define  ADC_SMPR2_SAMP13_Bit2                    (0x4U << ADC_SMPR2_SAMP13_Pos) 
#define  ADC_SMPR2_SAMP13_Bit3                    (0x8U << ADC_SMPR2_SAMP13_Pos) 
#define  ADC_SMPR2_SAMP14_Pos                     (24)
#define  ADC_SMPR2_SAMP14_Msk                     (0xFU << ADC_SMPR2_SAMP14_Pos)                    /*!<Channel 14 Sample Time Selection*/
#define  ADC_SMPR2_SAMP14                         ADC_SMPR2_SAMP14_Msk
#define  ADC_SMPR2_SAMP14_Bit0                    (0x1U << ADC_SMPR2_SAMP14_Pos) 
#define  ADC_SMPR2_SAMP14_Bit1                    (0x2U << ADC_SMPR2_SAMP14_Pos) 
#define  ADC_SMPR2_SAMP14_Bit2                    (0x4U << ADC_SMPR2_SAMP14_Pos) 
#define  ADC_SMPR2_SAMP14_Bit3                    (0x8U << ADC_SMPR2_SAMP14_Pos) 
#define  ADC_SMPR2_SAMP15_Pos                     (28)
#define  ADC_SMPR2_SAMP15_Msk                     (0xFU << ADC_SMPR2_SAMP15_Pos)                    /*!<Channel 15 Sample Time Selection These bits are used to independently select the sample time of each channel. In a sample cycle, the channel selection bit should remain unchanged*/
#define  ADC_SMPR2_SAMP15                         ADC_SMPR2_SAMP15_Msk
#define  ADC_SMPR2_SAMP15_Bit0                    (0x1U << ADC_SMPR2_SAMP15_Pos) 
#define  ADC_SMPR2_SAMP15_Bit1                    (0x2U << ADC_SMPR2_SAMP15_Pos) 
#define  ADC_SMPR2_SAMP15_Bit2                    (0x4U << ADC_SMPR2_SAMP15_Pos) 
#define  ADC_SMPR2_SAMP15_Bit3                    (0x8U << ADC_SMPR2_SAMP15_Pos) 

