SkydiverMCU/mcu-iap-demo/STAR-MC1/MM32F5370/USB_Custom_HID/MM32F5370_HID_Bootloader/Device/MM32F5370/Include/reg_adc.h
/**
  * @brief ADC_SMPR3 Register Bit Definition
  */
#define  ADC_SMPR3_SAMP16_Pos                     (0)
#define  ADC_SMPR3_SAMP16_Msk                     (0xFU << ADC_SMPR3_SAMP16_Pos)                    /*!<Channel 16 Sample Time Selection*/
#define  ADC_SMPR3_SAMP16                         ADC_SMPR3_SAMP16_Msk
#define  ADC_SMPR3_SAMP16_Bit0                    (0x1U << ADC_SMPR3_SAMP16_Pos) 
#define  ADC_SMPR3_SAMP16_Bit1                    (0x2U << ADC_SMPR3_SAMP16_Pos) 
#define  ADC_SMPR3_SAMP16_Bit2                    (0x4U << ADC_SMPR3_SAMP16_Pos) 
#define  ADC_SMPR3_SAMP16_Bit3                    (0x8U << ADC_SMPR3_SAMP16_Pos) 
#define  ADC_SMPR3_SAMP17_Pos                     (4)
#define  ADC_SMPR3_SAMP17_Msk                     (0xFU << ADC_SMPR3_SAMP17_Pos)                    /*!<Channel 17 Sample Time Selection*/
#define  ADC_SMPR3_SAMP17                         ADC_SMPR3_SAMP17_Msk
#define  ADC_SMPR3_SAMP17_Bit0                    (0x1U << ADC_SMPR3_SAMP17_Pos) 
#define  ADC_SMPR3_SAMP17_Bit1                    (0x2U << ADC_SMPR3_SAMP17_Pos) 
#define  ADC_SMPR3_SAMP17_Bit2                    (0x4U << ADC_SMPR3_SAMP17_Pos) 
#define  ADC_SMPR3_SAMP17_Bit3                    (0x8U << ADC_SMPR3_SAMP17_Pos) 
#define  ADC_SMPR3_SAMP18_Pos                     (8)
#define  ADC_SMPR3_SAMP18_Msk                     (0xFU << ADC_SMPR3_SAMP18_Pos)                    /*!<Channel 18 Sample Time Selection These bits are used to independently select the sample time of each channel. In a sample cycle, the channel selection bit should remain unchanged*/
#define  ADC_SMPR3_SAMP18                         ADC_SMPR3_SAMP18_Msk
#define  ADC_SMPR3_SAMP18_Bit0                    (0x1U << ADC_SMPR3_SAMP18_Pos) 
#define  ADC_SMPR3_SAMP18_Bit1                    (0x2U << ADC_SMPR3_SAMP18_Pos) 
#define  ADC_SMPR3_SAMP18_Bit2                    (0x4U << ADC_SMPR3_SAMP18_Pos) 
#define  ADC_SMPR3_SAMP18_Bit3                    (0x8U << ADC_SMPR3_SAMP18_Pos) 

/**
  * @brief ADC_JOFR Register Bit Definition
  */
#define  ADC_JOFR_JOFFSET_Pos                     (0)
#define  ADC_JOFR_JOFFSET_Msk                     (0xFFFU << ADC_JOFR_JOFFSET_Pos)                  /*!<Data Offset Register for 12-bit AD Injected Channel n*/
#define  ADC_JOFR_JOFFSET                         ADC_JOFR_JOFFSET_Msk
#define  ADC_JOFR_JOFFSET_Bit0                    (0x001U << ADC_JOFR_JOFFSET_Pos) 
#define  ADC_JOFR_JOFFSET_Bit1                    (0x002U << ADC_JOFR_JOFFSET_Pos) 
#define  ADC_JOFR_JOFFSET_Bit2                    (0x004U << ADC_JOFR_JOFFSET_Pos) 
#define  ADC_JOFR_JOFFSET_Bit3                    (0x008U << ADC_JOFR_JOFFSET_Pos) 
#define  ADC_JOFR_JOFFSET_Bit4                    (0x010U << ADC_JOFR_JOFFSET_Pos) 
#define  ADC_JOFR_JOFFSET_Bit5                    (0x020U << ADC_JOFR_JOFFSET_Pos) 
#define  ADC_JOFR_JOFFSET_Bit6                    (0x040U << ADC_JOFR_JOFFSET_Pos) 
#define  ADC_JOFR_JOFFSET_Bit7                    (0x080U << ADC_JOFR_JOFFSET_Pos) 
#define  ADC_JOFR_JOFFSET_Bit8                    (0x100U << ADC_JOFR_JOFFSET_Pos) 
#define  ADC_JOFR_JOFFSET_Bit9                    (0x200U << ADC_JOFR_JOFFSET_Pos) 
#define  ADC_JOFR_JOFFSET_Bit10                   (0x400U << ADC_JOFR_JOFFSET_Pos) 
#define  ADC_JOFR_JOFFSET_Bit11                   (0x800U << ADC_JOFR_JOFFSET_Pos) 

/**
  * @brief ADC_JSQR Register Bit Definition
  */
#define  ADC_JSQR_JSQ0_Pos                        (0)
#define  ADC_JSQR_JSQ0_Msk                        (0x1FU << ADC_JSQR_JSQ0_Pos)                      /*!<0th Conversion for Injected Sequence*/
#define  ADC_JSQR_JSQ0                            ADC_JSQR_JSQ0_Msk
#define  ADC_JSQR_JSQ0_Bit0                       (0x01U << ADC_JSQR_JSQ0_Pos) 
#define  ADC_JSQR_JSQ0_Bit1                       (0x02U << ADC_JSQR_JSQ0_Pos) 
#define  ADC_JSQR_JSQ0_Bit2                       (0x04U << ADC_JSQR_JSQ0_Pos) 
#define  ADC_JSQR_JSQ0_Bit3                       (0x08U << ADC_JSQR_JSQ0_Pos) 
#define  ADC_JSQR_JSQ0_Bit4                       (0x10U << ADC_JSQR_JSQ0_Pos) 
#define  ADC_JSQR_JSQ1_Pos                        (5)
#define  ADC_JSQR_JSQ1_Msk                        (0x1FU << ADC_JSQR_JSQ1_Pos)                      /*!<1th Conversion for Injected Sequence*/
#define  ADC_JSQR_JSQ1                            ADC_JSQR_JSQ1_Msk
#define  ADC_JSQR_JSQ1_Bit0                       (0x01U << ADC_JSQR_JSQ1_Pos) 
#define  ADC_JSQR_JSQ1_Bit1                       (0x02U << ADC_JSQR_JSQ1_Pos) 
#define  ADC_JSQR_JSQ1_Bit2                       (0x04U << ADC_JSQR_JSQ1_Pos) 
#define  ADC_JSQR_JSQ1_Bit3                       (0x08U << ADC_JSQR_JSQ1_Pos) 
#define  ADC_JSQR_JSQ1_Bit4                       (0x10U << ADC_JSQR_JSQ1_Pos) 
#define  ADC_JSQR_JSQ2_Pos                        (10)
#define  ADC_JSQR_JSQ2_Msk                        (0x1FU << ADC_JSQR_JSQ2_Pos)                      /*!<2th Conversion for Injected Sequence*/
#define  ADC_JSQR_JSQ2                            ADC_JSQR_JSQ2_Msk
#define  ADC_JSQR_JSQ2_Bit0                       (0x01U << ADC_JSQR_JSQ2_Pos) 
#define  ADC_JSQR_JSQ2_Bit1                       (0x02U << ADC_JSQR_JSQ2_Pos) 
#define  ADC_JSQR_JSQ2_Bit2                       (0x04U << ADC_JSQR_JSQ2_Pos) 
#define  ADC_JSQR_JSQ2_Bit3                       (0x08U << ADC_JSQR_JSQ2_Pos) 
#define  ADC_JSQR_JSQ2_Bit4                       (0x10U << ADC_JSQR_JSQ2_Pos) 
#define  ADC_JSQR_JSQ3_Pos                        (15)
#define  ADC_JSQR_JSQ3_Msk                        (0x1FU << ADC_JSQR_JSQ3_Pos)                      /*!<3th Conversion for Injected Sequence*/
#define  ADC_JSQR_JSQ3                            ADC_JSQR_JSQ3_Msk
#define  ADC_JSQR_JSQ3_Bit0                       (0x01U << ADC_JSQR_JSQ3_Pos) 
#define  ADC_JSQR_JSQ3_Bit1                       (0x02U << ADC_JSQR_JSQ3_Pos) 
#define  ADC_JSQR_JSQ3_Bit2                       (0x04U << ADC_JSQR_JSQ3_Pos) 
#define  ADC_JSQR_JSQ3_Bit3                       (0x08U << ADC_JSQR_JSQ3_Pos) 
#define  ADC_JSQR_JSQ3_Bit4                       (0x10U << ADC_JSQR_JSQ3_Pos) 
#define  ADC_JSQR_JNUM_Pos                        (20)
#define  ADC_JSQR_JNUM_Msk                        (0x3U << ADC_JSQR_JNUM_Pos)                       /*!<Channel Number for Injected Sequence*/
#define  ADC_JSQR_JNUM                            ADC_JSQR_JNUM_Msk
#define  ADC_JSQR_JNUM_Bit0                       (0x1U << ADC_JSQR_JNUM_Pos) 
#define  ADC_JSQR_JNUM_Bit1                       (0x2U << ADC_JSQR_JNUM_Pos) 

/**
  * @brief ADC_JADDATA Register Bit Definition
  */
#define  ADC_JADDATA_JDATA_Pos                    (0)
#define  ADC_JADDATA_JDATA_Msk                    (0xFFFFU << ADC_JADDATA_JDATA_Pos)                /*!<12-bit A/D conversion result of current injected channel. The alignment style is selected via software.*/
#define  ADC_JADDATA_JDATA                        ADC_JADDATA_JDATA_Msk
#define  ADC_JADDATA_JDATA_Bit0                   (0x0001U << ADC_JADDATA_JDATA_Pos) 
#define  ADC_JADDATA_JDATA_Bit1                   (0x0002U << ADC_JADDATA_JDATA_Pos) 
#define  ADC_JADDATA_JDATA_Bit2                   (0x0004U << ADC_JADDATA_JDATA_Pos) 
#define  ADC_JADDATA_JDATA_Bit3                   (0x0008U << ADC_JADDATA_JDATA_Pos) 
#define  ADC_JADDATA_JDATA_Bit4                   (0x0010U << ADC_JADDATA_JDATA_Pos) 
#define  ADC_JADDATA_JDATA_Bit5                   (0x0020U << ADC_JADDATA_JDATA_Pos) 
#define  ADC_JADDATA_JDATA_Bit6                   (0x0040U << ADC_JADDATA_JDATA_Pos) 
#define  ADC_JADDATA_JDATA_Bit7                   (0x0080U << ADC_JADDATA_JDATA_Pos) 
#define  ADC_JADDATA_JDATA_Bit8                   (0x0100U << ADC_JADDATA_JDATA_Pos) 
#define  ADC_JADDATA_JDATA_Bit9                   (0x0200U << ADC_JADDATA_JDATA_Pos) 
#define  ADC_JADDATA_JDATA_Bit10                  (0x0400U << ADC_JADDATA_JDATA_Pos) 
#define  ADC_JADDATA_JDATA_Bit11                  (0x0800U << ADC_JADDATA_JDATA_Pos) 
#define  ADC_JADDATA_JDATA_Bit12                  (0x1000U << ADC_JADDATA_JDATA_Pos) 
#define  ADC_JADDATA_JDATA_Bit13                  (0x2000U << ADC_JADDATA_JDATA_Pos) 
#define  ADC_JADDATA_JDATA_Bit14                  (0x4000U << ADC_JADDATA_JDATA_Pos) 
#define  ADC_JADDATA_JDATA_Bit15                  (0x8000U << ADC_JADDATA_JDATA_Pos) 
#define  ADC_JADDATA_JCHANNELSEL_Pos              (16)
#define  ADC_JADDATA_JCHANNELSEL_Msk              (0x1FU << ADC_JADDATA_JCHANNELSEL_Pos)            /*!<*/
#define  ADC_JADDATA_JCHANNELSEL                  ADC_JADDATA_JCHANNELSEL_Msk
#define  ADC_JADDATA_JCHANNELSEL_Bit0             (0x01U << ADC_JADDATA_JCHANNELSEL_Pos) 
#define  ADC_JADDATA_JCHANNELSEL_Bit1             (0x02U << ADC_JADDATA_JCHANNELSEL_Pos) 
#define  ADC_JADDATA_JCHANNELSEL_Bit2             (0x04U << ADC_JADDATA_JCHANNELSEL_Pos) 
#define  ADC_JADDATA_JCHANNELSEL_Bit3             (0x08U << ADC_JADDATA_JCHANNELSEL_Pos) 
#define  ADC_JADDATA_JCHANNELSEL_Bit4             (0x10U << ADC_JADDATA_JCHANNELSEL_Pos) 
#define  ADC_JADDATA_JOVERRUN_Pos                 (21)
#define  ADC_JADDATA_JOVERRUN_Msk                 (0x1U << ADC_JADDATA_JOVERRUN_Pos)                /*!<Overrun Flag for Injected Channels (read-only)*/
#define  ADC_JADDATA_JOVERRUN                     ADC_JADDATA_JOVERRUN_Msk
#define  ADC_JADDATA_JVALID_Pos                   (22)
#define  ADC_JADDATA_JVALID_Msk                   (0x1U << ADC_JADDATA_JVALID_Pos)                  /*!<Valid Flag for Injected Channels (read-only)*/
#define  ADC_JADDATA_JVALID                       ADC_JADDATA_JVALID_Msk

/**
  * @brief ADC_CORRS Register Bit Definition
  */
#define  ADC_CORRS_GAINCORR_Pos                   (0)
#define  ADC_CORRS_GAINCORR_Msk                   (0xFFFU << ADC_CORRS_GAINCORR_Pos)                /*!<The 12-bit gain correction parameter*/
#define  ADC_CORRS_GAINCORR                       ADC_CORRS_GAINCORR_Msk
#define  ADC_CORRS_GAINCORR_Bit0                  (0x001U << ADC_CORRS_GAINCORR_Pos) 
#define  ADC_CORRS_GAINCORR_Bit1                  (0x002U << ADC_CORRS_GAINCORR_Pos) 
#define  ADC_CORRS_GAINCORR_Bit2                  (0x004U << ADC_CORRS_GAINCORR_Pos) 
#define  ADC_CORRS_GAINCORR_Bit3                  (0x008U << ADC_CORRS_GAINCORR_Pos) 
#define  ADC_CORRS_GAINCORR_Bit4                  (0x010U << ADC_CORRS_GAINCORR_Pos) 
#define  ADC_CORRS_GAINCORR_Bit5                  (0x020U << ADC_CORRS_GAINCORR_Pos) 
#define  ADC_CORRS_GAINCORR_Bit6                  (0x040U << ADC_CORRS_GAINCORR_Pos) 
#define  ADC_CORRS_GAINCORR_Bit7                  (0x080U << ADC_CORRS_GAINCORR_Pos) 
#define  ADC_CORRS_GAINCORR_Bit8                  (0x100U << ADC_CORRS_GAINCORR_Pos) 
#define  ADC_CORRS_GAINCORR_Bit9                  (0x200U << ADC_CORRS_GAINCORR_Pos) 
#define  ADC_CORRS_GAINCORR_Bit10                 (0x400U << ADC_CORRS_GAINCORR_Pos) 
#define  ADC_CORRS_GAINCORR_Bit11                 (0x800U << ADC_CORRS_GAINCORR_Pos) 
#define  ADC_CORRS_OFFSETCORR_Pos                 (16)
#define  ADC_CORRS_OFFSETCORR_Msk                 (0xFFFU << ADC_CORRS_OFFSETCORR_Pos)              /*!<The 12-bit offset correction parameter*/
#define  ADC_CORRS_OFFSETCORR                     ADC_CORRS_OFFSETCORR_Msk
#define  ADC_CORRS_OFFSETCORR_Bit0                (0x001U << ADC_CORRS_OFFSETCORR_Pos) 
#define  ADC_CORRS_OFFSETCORR_Bit1                (0x002U << ADC_CORRS_OFFSETCORR_Pos) 
#define  ADC_CORRS_OFFSETCORR_Bit2                (0x004U << ADC_CORRS_OFFSETCORR_Pos) 
#define  ADC_CORRS_OFFSETCORR_Bit3                (0x008U << ADC_CORRS_OFFSETCORR_Pos) 
#define  ADC_CORRS_OFFSETCORR_Bit4                (0x010U << ADC_CORRS_OFFSETCORR_Pos) 
#define  ADC_CORRS_OFFSETCORR_Bit5                (0x020U << ADC_CORRS_OFFSETCORR_Pos) 
#define  ADC_CORRS_OFFSETCORR_Bit6                (0x040U << ADC_CORRS_OFFSETCORR_Pos) 
#define  ADC_CORRS_OFFSETCORR_Bit7                (0x080U << ADC_CORRS_OFFSETCORR_Pos) 
#define  ADC_CORRS_OFFSETCORR_Bit8                (0x100U << ADC_CORRS_OFFSETCORR_Pos) 
#define  ADC_CORRS_OFFSETCORR_Bit9                (0x200U << ADC_CORRS_OFFSETCORR_Pos) 
#define  ADC_CORRS_OFFSETCORR_Bit10               (0x400U << ADC_CORRS_OFFSETCORR_Pos) 
#define  ADC_CORRS_OFFSETCORR_Bit11               (0x800U << ADC_CORRS_OFFSETCORR_Pos) 

/**
  * @brief ADC_CORRD Register Bit Definition
  */
#define  ADC_CORRD_GAINCORR_Pos                   (0)
#define  ADC_CORRD_GAINCORR_Msk                   (0xFFFU << ADC_CORRD_GAINCORR_Pos)                /*!<The 12-bit gain correction parameters*/
#define  ADC_CORRD_GAINCORR                       ADC_CORRD_GAINCORR_Msk
#define  ADC_CORRD_GAINCORR_Bit0                  (0x001U << ADC_CORRD_GAINCORR_Pos) 
#define  ADC_CORRD_GAINCORR_Bit1                  (0x002U << ADC_CORRD_GAINCORR_Pos) 
#define  ADC_CORRD_GAINCORR_Bit2                  (0x004U << ADC_CORRD_GAINCORR_Pos) 
#define  ADC_CORRD_GAINCORR_Bit3                  (0x008U << ADC_CORRD_GAINCORR_Pos) 
#define  ADC_CORRD_GAINCORR_Bit4                  (0x010U << ADC_CORRD_GAINCORR_Pos) 
#define  ADC_CORRD_GAINCORR_Bit5                  (0x020U << ADC_CORRD_GAINCORR_Pos) 
#define  ADC_CORRD_GAINCORR_Bit6                  (0x040U << ADC_CORRD_GAINCORR_Pos) 
#define  ADC_CORRD_GAINCORR_Bit7                  (0x080U << ADC_CORRD_GAINCORR_Pos) 
#define  ADC_CORRD_GAINCORR_Bit8                  (0x100U << ADC_CORRD_GAINCORR_Pos) 
#define  ADC_CORRD_GAINCORR_Bit9                  (0x200U << ADC_CORRD_GAINCORR_Pos) 
#define  ADC_CORRD_GAINCORR_Bit10                 (0x400U << ADC_CORRD_GAINCORR_Pos) 
#define  ADC_CORRD_GAINCORR_Bit11                 (0x800U << ADC_CORRD_GAINCORR_Pos) 
#define  ADC_CORRD_OFFSETCORR_Pos                 (16)
#define  ADC_CORRD_OFFSETCORR_Msk                 (0xFFFU << ADC_CORRD_OFFSETCORR_Pos)              /*!<The 12-bit offset correction parameter*/
#define  ADC_CORRD_OFFSETCORR                     ADC_CORRD_OFFSETCORR_Msk
#define  ADC_CORRD_OFFSETCORR_Bit0                (0x001U << ADC_CORRD_OFFSETCORR_Pos) 
#define  ADC_CORRD_OFFSETCORR_Bit1                (0x002U << ADC_CORRD_OFFSETCORR_Pos) 
#define  ADC_CORRD_OFFSETCORR_Bit2                (0x004U << ADC_CORRD_OFFSETCORR_Pos) 
#define  ADC_CORRD_OFFSETCORR_Bit3                (0x008U << ADC_CORRD_OFFSETCORR_Pos) 
#define  ADC_CORRD_OFFSETCORR_Bit4                (0x010U << ADC_CORRD_OFFSETCORR_Pos) 
#define  ADC_CORRD_OFFSETCORR_Bit5                (0x020U << ADC_CORRD_OFFSETCORR_Pos) 
#define  ADC_CORRD_OFFSETCORR_Bit6                (0x040U << ADC_CORRD_OFFSETCORR_Pos) 
#define  ADC_CORRD_OFFSETCORR_Bit7                (0x080U << ADC_CORRD_OFFSETCORR_Pos) 
#define  ADC_CORRD_OFFSETCORR_Bit8                (0x100U << ADC_CORRD_OFFSETCORR_Pos) 
#define  ADC_CORRD_OFFSETCORR_Bit9                (0x200U << ADC_CORRD_OFFSETCORR_Pos) 
#define  ADC_CORRD_OFFSETCORR_Bit10               (0x400U << ADC_CORRD_OFFSETCORR_Pos) 
#define  ADC_CORRD_OFFSETCORR_Bit11               (0x800U << ADC_CORRD_OFFSETCORR_Pos) 

/**
  * @brief ADC_CORRP Register Bit Definition
  */
#define  ADC_CORRP_GAINCORR_Pos                   (0)
#define  ADC_CORRP_GAINCORR_Msk                   (0xFFFU << ADC_CORRP_GAINCORR_Pos)                /*!<The 12-bit gain correction parameters*/
#define  ADC_CORRP_GAINCORR                       ADC_CORRP_GAINCORR_Msk
#define  ADC_CORRP_GAINCORR_Bit0                  (0x001U << ADC_CORRP_GAINCORR_Pos) 
#define  ADC_CORRP_GAINCORR_Bit1                  (0x002U << ADC_CORRP_GAINCORR_Pos) 
#define  ADC_CORRP_GAINCORR_Bit2                  (0x004U << ADC_CORRP_GAINCORR_Pos) 
#define  ADC_CORRP_GAINCORR_Bit3                  (0x008U << ADC_CORRP_GAINCORR_Pos) 
#define  ADC_CORRP_GAINCORR_Bit4                  (0x010U << ADC_CORRP_GAINCORR_Pos) 
#define  ADC_CORRP_GAINCORR_Bit5                  (0x020U << ADC_CORRP_GAINCORR_Pos) 
#define  ADC_CORRP_GAINCORR_Bit6                  (0x040U << ADC_CORRP_GAINCORR_Pos) 
#define  ADC_CORRP_GAINCORR_Bit7                  (0x080U << ADC_CORRP_GAINCORR_Pos) 
#define  ADC_CORRP_GAINCORR_Bit8                  (0x100U << ADC_CORRP_GAINCORR_Pos) 
#define  ADC_CORRP_GAINCORR_Bit9                  (0x200U << ADC_CORRP_GAINCORR_Pos) 
#define  ADC_CORRP_GAINCORR_Bit10                 (0x400U << ADC_CORRP_GAINCORR_Pos) 
#define  ADC_CORRP_GAINCORR_Bit11                 (0x800U << ADC_CORRP_GAINCORR_Pos) 
#define  ADC_CORRP_OFFSETCORR_Pos                 (16)
#define  ADC_CORRP_OFFSETCORR_Msk                 (0xFFFU << ADC_CORRP_OFFSETCORR_Pos)              /*!<The 12-bit offset correction parameter*/
#define  ADC_CORRP_OFFSETCORR                     ADC_CORRP_OFFSETCORR_Msk
#define  ADC_CORRP_OFFSETCORR_Bit0                (0x001U << ADC_CORRP_OFFSETCORR_Pos) 
#define  ADC_CORRP_OFFSETCORR_Bit1                (0x002U << ADC_CORRP_OFFSETCORR_Pos) 
#define  ADC_CORRP_OFFSETCORR_Bit2                (0x004U << ADC_CORRP_OFFSETCORR_Pos) 
#define  ADC_CORRP_OFFSETCORR_Bit3                (0x008U << ADC_CORRP_OFFSETCORR_Pos) 
#define  ADC_CORRP_OFFSETCORR_Bit4                (0x010U << ADC_CORRP_OFFSETCORR_Pos) 
#define  ADC_CORRP_OFFSETCORR_Bit5                (0x020U << ADC_CORRP_OFFSETCORR_Pos) 
#define  ADC_CORRP_OFFSETCORR_Bit6                (0x040U << ADC_CORRP_OFFSETCORR_Pos) 
#define  ADC_CORRP_OFFSETCORR_Bit7                (0x080U << ADC_CORRP_OFFSETCORR_Pos) 
#define  ADC_CORRP_OFFSETCORR_Bit8                (0x100U << ADC_CORRP_OFFSETCORR_Pos) 
#define  ADC_CORRP_OFFSETCORR_Bit9                (0x200U << ADC_CORRP_OFFSETCORR_Pos) 
#define  ADC_CORRP_OFFSETCORR_Bit10               (0x400U << ADC_CORRP_OFFSETCORR_Pos) 
#define  ADC_CORRP_OFFSETCORR_Bit11               (0x800U << ADC_CORRP_OFFSETCORR_Pos) 

/**
  * @brief ADC_JDR Register Bit Definition
  */
#define  ADC_JDR_JDATA_Pos                        (0)
#define  ADC_JDR_JDATA_Msk                        (0xFFFFU << ADC_JDR_JDATA_Pos)                    /*!<Conversion result of A/D injected channel n (Transfer Data for Injected Channels)*/
#define  ADC_JDR_JDATA                            ADC_JDR_JDATA_Msk
#define  ADC_JDR_JDATA_Bit0                       (0x0001U << ADC_JDR_JDATA_Pos) 
#define  ADC_JDR_JDATA_Bit1                       (0x0002U << ADC_JDR_JDATA_Pos) 
#define  ADC_JDR_JDATA_Bit2                       (0x0004U << ADC_JDR_JDATA_Pos) 
#define  ADC_JDR_JDATA_Bit3                       (0x0008U << ADC_JDR_JDATA_Pos) 
#define  ADC_JDR_JDATA_Bit4                       (0x0010U << ADC_JDR_JDATA_Pos) 
#define  ADC_JDR_JDATA_Bit5                       (0x0020U << ADC_JDR_JDATA_Pos) 
#define  ADC_JDR_JDATA_Bit6                       (0x0040U << ADC_JDR_JDATA_Pos) 
#define  ADC_JDR_JDATA_Bit7                       (0x0080U << ADC_JDR_JDATA_Pos) 
#define  ADC_JDR_JDATA_Bit8                       (0x0100U << ADC_JDR_JDATA_Pos) 
#define  ADC_JDR_JDATA_Bit9                       (0x0200U << ADC_JDR_JDATA_Pos) 
#define  ADC_JDR_JDATA_Bit10                      (0x0400U << ADC_JDR_JDATA_Pos) 
#define  ADC_JDR_JDATA_Bit11                      (0x0800U << ADC_JDR_JDATA_Pos) 
#define  ADC_JDR_JDATA_Bit12                      (0x1000U << ADC_JDR_JDATA_Pos) 
#define  ADC_JDR_JDATA_Bit13                      (0x2000U << ADC_JDR_JDATA_Pos) 
#define  ADC_JDR_JDATA_Bit14                      (0x4000U << ADC_JDR_JDATA_Pos) 
#define  ADC_JDR_JDATA_Bit15                      (0x8000U << ADC_JDR_JDATA_Pos) 
#define  ADC_JDR_JOVERRUN_Pos                     (21)
#define  ADC_JDR_JOVERRUN_Msk                     (0x1U << ADC_JDR_JOVERRUN_Pos)                    /*!<Overrun Flag for Injected Channels*/
#define  ADC_JDR_JOVERRUN                         ADC_JDR_JOVERRUN_Msk
#define  ADC_JDR_JVALID_Pos                       (22)
#define  ADC_JDR_JVALID_Msk                       (0x1U << ADC_JDR_JVALID_Pos)                      /*!<Valid Flag for Injected Channels*/
#define  ADC_JDR_JVALID                           ADC_JDR_JVALID_Msk


#endif

